{
  "timestamp": 1750824447.8722284,
  "goal": "# Architecture Document: Ironclad Code Generation System\n\n## 1. Introduction and Goals\n\nThe Ironclad Code Generation System is designed to automate and standardize the process of generating software module implementations based on formal architectural specifications and interface contracts. At its core, the system acts as a sophisticated build tool that leverages the capabilities of Large Language Models (LLMs) for code generation, while ensuring the output adheres strictly to predefined structural, contractual, and validation rules.\n\nThe product idea addresses a critical need in modern software development: maintaining consistency, correctness, and security across numerous microservices or modules, particularly when dealing with complex domain logic and inter-module dependencies. Manually writing boilerplate code, implementing intricate interfaces, and ensuring adherence to coding standards and validation rules is time-consuming, error-prone, and difficult to scale across large teams or projects.\n\nThe target audience for the Ironclad system includes software architects, development teams, and CI/CD engineers working on projects that require a high degree of architectural discipline, code quality consistency, and accelerated module development.\n\nThe primary problem solved is the translation of formal module specifications and interface contracts into high-quality, validated, and test-covered code implementations in a deterministic and automatable manner. This reduces manual effort, minimizes human error in implementing contracts and rules, and ensures that generated code components are inherently aligned with the system's architecture from inception.\n\nThe key objectives this architecture aims to achieve are:\n\n*   **Determinism:** Given a specific set of inputs (ARCHITECTURE_SPEC, contracts, context, validation rules, prompt templates, and a specific version/state of the IMG LLM), the system should produce the same output code and failure reports.\n*   **Correctness and Adherence:** Ensure that generated code precisely implements the defined module contracts (interfaces) and adheres to all specified validation rules (DSL checks, type safety, linter rules).\n*   **Efficiency:** Enable parallel generation of independent modules to reduce overall build time.\n*   **Resilience:** Implement retry mechanisms for transient LLM generation failures and isolate module generation tasks to prevent single-module issues from halting the entire process.\n*   **Auditability and Integrity:** Provide mechanisms (like BlueprintLock) to verify the integrity of the generated system blueprint and maintain a clear record of generation failures.\n*   **Extensibility:** Design the system such that adding new validation rules, prompt templates, or supporting different output languages is feasible.\n*   **Maintainability:** Structure the system's components logically with clear responsibilities and interfaces to facilitate understanding, modification, and debugging.\n\nBy achieving these goals, the Ironclad system serves as a robust blueprint-to-code pipeline, significantly enhancing developer productivity, code quality, and architectural compliance.\n\n## 2. High-Level Architecture Overview\n\nThe Ironclad Code Generation System operates primarily as a pipeline orchestrated by distinct processes interacting with a shared file-based repository. It is not a continuously running service but rather an on-demand tool executed within a build environment (developer machine or CI/CD pipeline).\n\nThe architecture consists of two main phases, executed sequentially:\n1.  **Blueprint Initialization Phase:** Executed by the **Ironclad Blueprint Architect (IBA)**.\n2.  **Code Generation and Validation Phase:** Exechestraed by the **Task Runner**, which spawns **Job** processes that interact with the **Ironclad Module Generator (IMG)** and **Validation Engines**.\n\nHere's a textual description of the main components and their interactions:\n\n```mermaid\ngraph TD\n    A[ARCHITECTURE_SPEC] --> B(Ironclad Blueprint Architect - IBA);\n    B --> C(Repository Skeleton);\n    C --> D(contracts/*.json);\n    C --> E(idl/*.ts);\n    C --> F(system_context.json);\n    C --> G(validation_dsl_spec.md);\n    C --> H(prompt_templates/*.tmpl);\n    C --> I(src/modules/I*.ts - Interface Stubs);\n    C --> J(Repository - Initialized State);\n\n    J --> K(Task Runner);\n    K -- Discovers modules --> D;\n    K -- Manages concurrency --> L(Concurrency Limit IRONCLAD_MAX_PARALLEL);\n    K -- Creates isolated workspaces --> M(Task Workspaces .tmp/ironclad_tasks/);\n    M -- Workspace Prep --> D, E, F, G, I;\n    M -- Construct Prompt --> N(Prompt File prompt.txt);\n    N --> O(Job - Spawned Process);\n    O -- Calls --> P(Ironclad Module Generator - IMG LLM);\n    P -- Returns JSON {code, test} --> O;\n    O -- Executes Validation --> Q(Validation Engines: tsc, DSL, Test Runner, Edge Case Check);\n    Q -- Reports failures --> R(failures.json / final_failure.json - in workspace);\n    O -- Writes generated code (if successful) --> S(Generated Code/Tests - in workspace);\n\n    K -- Awaits Job Completion --> O;\n    K -- Aggregates Results --> R, S;\n    K -- Merges successful outputs --> T(Repository - Final State with src/*.ts);\n    K -- Collates failures --> U(.ironclad_failures.json - top-level);\n    K -- Executes Global Validation --> V(Global Validation: Full tsc, Global DSL, Integration Tests);\n    V -- Reports success/failure --> W(Exit Code);\n\n    style A fill:#f9f,stroke:#333,stroke-width:2px\n    style B fill:#ccf,stroke:#333,stroke-width:2px\n    style K fill:#ccf,stroke:#333,stroke-width:2px\n    style O fill:#ccf,stroke:#333,stroke-width:2px\n    style P fill:#ff9,stroke:#333,stroke-width:2px\n    style Q fill:#9cf,stroke:#333,stroke-width:2px\n    style T fill:#cfc,stroke:#333,stroke-width:2px\n```\n\n**Component Descriptions:**\n\n*   **ARCHITECTURE_SPEC:** The primary input file defining the overall system structure, including module names, potentially high-level descriptions, and references to contracts.\n*   **Ironclad Blueprint Architect (IBA):** A command-line tool that reads the ARCHITECTURE_SPEC and associated files (contracts, IDLs, etc.), performs initial validations (like DAG integrity), and sets up the initial repository structure with all necessary non-implementation files and interface stubs. It ensures the foundational elements are correct before code generation begins. It embeds integrity checks (BlueprintLock) in emitted files.\n*   **Repository:** The central file-based storage where all architectural definitions (contracts, IDLs), context files, templates, generated code, and reports reside. It transitions from an \"Initialized State\" (post-IBA) to a \"Final State\" (post-Task Runner with merged code).\n*   **Task Runner:** The orchestrator of the code generation phase. It runs as a main process, reads the initialized repository, identifies modules to generate, prepares isolated environments for each module, manages the spawning and monitoring of Job processes, and performs final aggregation and global validation.\n*   **Job:** A short-lived, isolated process spawned by the Task Runner for a single module. It works within its dedicated workspace, interacts with the IMG, runs the validation sequence on the generated code, handles retries, and reports its final status.\n*   **Ironclad Module Generator (IMG):** An external Large Language Model (LLM) or an API wrapper around one. Its sole function is to take a structured prompt as input and return a JSON object containing the generated implementation code and test code for a single module. The architecture views this as a black box service invoked over an API.\n*   **Task Workspaces:** Isolated directories created by the Task Runner, containing only the necessary files for a single module's generation task (its contract, dependencies' contracts/interfaces, IDLs, context files, prompt template). This isolation is crucial for preventing cross-task interference and ensuring deterministic generation per module.\n*   **Validation Engines:** A set of tools and scripts (TypeScript compiler `tsc`, custom DSL validators, test runner like Jest/Mocha) invoked by the Job process to verify the correctness and adherence of the generated code.\n*   **Generated Code/Tests:** The `*.ts` and `*.test.ts` files produced by the IMG and validated by the Job. Successfully validated files are eventually merged into the main repository.\n*   **Failure Reports:** JSON files (`failures.json`, `final_failure.json`) detailing validation errors or generation issues within a Job's workspace. These are collated by the Task Runner into a top-level `.ironclad_failures.json`.\n*   **Global Validation:** Final checks performed by the Task Runner on the complete, merged codebase (e.g., full project type-check, integration tests).\n\n**Technology Stack Choices and Justifications:**\n\n*   **Primary Language (Task Runner, IBA, Validation Logic):** TypeScript/Node.js.\n    *   *Justification:* Provides type safety for building robust tooling, leverages the vast npm ecosystem (file system operations, process management, JSON parsing, hashing, templating), excellent for CLI tools, and aligns well with generating TypeScript code. Node.js's asynchronous nature is suitable for managing concurrent Jobs.\n*   **Repository Management:** Git and File System.\n    *   *Justification:* Standard, widely adopted tools for source control and project structure. The system's state is inherently file-based (specifications, contracts, generated code). Leveraging Git simplifies versioning, collaboration, and integration into existing CI/CD workflows.\n*   **Configuration/Specification Format:** JSON, Markdown, Plain Text files (for templates).\n    *   *Justification:* JSON is standard, machine-readable, and ideal for structured data like contracts and failure reports. Markdown is suitable for human-readable specs (ARCHITECTURE_SPEC, validation DSL spec). Plain text templates are standard for prompt generation.\n*   **Code Generation Model:** Large Language Model (IMG).\n    *   *Justification:* LLMs are powerful for translating natural language instructions and structured data (from prompts) into code. This is the core innovation allowing automated code generation. Specific LLM choice is abstracted behind the IMG interface.\n*   **Validation Tools:**\n    *   `tsc` (TypeScript Compiler): Essential for static type checking, ensuring the generated code conforms to the defined interfaces (`I<ModuleName>.ts`).\n    *   Jest/Mocha (Test Runner): Standard JavaScript/TypeScript test frameworks for executing generated unit tests (`*.test.ts`).\n    *   Custom Scripts/Libraries: For DSL rule validation, edge case string checks, JSON schema validation. Implementations will depend on the specific DSL format chosen.\n    *   Linters (e.g., ESLint, Prettier): Can be integrated into validation steps to enforce coding style and detect common errors.\n    *   Security Linters (e.g., SonarQube scanner, Semgrep): Can be added for basic static analysis security checks on generated code.\n*   **Process Management:** Node.js `child_process` module or similar.\n    *   *Justification:* Native capabilities in Node.js for spawning independent processes (`fork` or `spawn`) are required to implement the Job isolation and concurrency model.\n*   **Hashing:** Standard cryptographic library (e.g., Node.js `crypto`).\n    *   *Justification:* Required for generating SHA-256 hashes for the BlueprintLock integrity check and prompt hash verification.\n\nThis architecture emphasizes using standard tools and file-based workflows to keep the system itself relatively simple, robust, and integrable, while abstracting the complex, non-deterministic part (LLM generation) behind a well-defined interface and surrounding it with deterministic validation and retry logic.\n\n## 3. Detailed Component Design\n\nThis section details the design and responsibilities of the primary components within the Ironclad system.\n\n### 3.1. Ironclad Blueprint Architect (IBA)\n\n*   **Responsibilities:**\n    *   Read the master `ARCHITECTURE_SPEC` file.\n    *   Parse and validate all individual module contract files (`contracts/*.json`).\n    *   Construct and validate the module dependency graph (from `contracts/*.json`) to ensure it is a Directed Acyclic Graph (DAG). Reject input if cycles are detected.\n    *   Parse and validate the `system_context.json` and `validation_dsl_spec.md` files.\n    *   Validate prompt template files (`prompt_templates/*.tmpl`).\n    *   Scaffold the initial repository directory structure (e.g., `contracts/`, `idl/`, `src/modules/`, `prompt_templates/`, `.tmp/`, etc.).\n    *   Generate Interface Definition Language (IDL) files (`idl/*.ts`) based on specifications (not explicitly detailed in spec but a logical precursor to `I*.ts`). *Self-correction: The spec only mentions `idl/` directory and `src/modules/I*.ts` stubs. I'll focus on generating the `I*.ts` stubs based on contracts, assuming the contract JSON implicitly or explicitly defines the interface surface.*\n    *   Copy validated contract, context, DSL spec, and template files to their canonical locations in the repository.\n    *   Generate module interface stub files (`src/modules/I<ModuleName>.ts`) based on the module contracts.\n    *   Embed a `BlueprintLock: sha256:<hash>` header in *every* file it writes or copies into the repository (contracts, IDLs, interface stubs, context, DSL spec, templates). This hash is calculated over the file's content *after* adding the header line itself (a standard practice requiring careful handling of the header calculation).\n    *   Ensure the initial state of `src/modules/` contains only the generated interface stubs (`I*.ts`) and no implementation files (`*.ts`).\n*   **APIs (Internal Contracts):**\n    *   `validateContracts(contractFiles: string[]): Map<string, ModuleContract>`: Reads and validates JSON schema/content of contract files, returns a map of module name to parsed contract object.\n    *   `buildDependencyGraph(contracts: Map<string, ModuleContract>): DependencyGraph`: Constructs graph data structure from contract dependencies.\n    *   `validateDAG(graph: DependencyGraph): boolean`: Checks for cycles in the dependency graph. Throws error if cycle detected.\n    *   `generateInterfaceStubs(contracts: Map<string, ModuleContract>, outputPath: string): Map<string, string>`: Generates TypeScript interface code strings based on contracts.\n    *   `writeFilesWithBlueprintLock(files: Map<string, string>, baseDir: string): void`: Writes file content to disk, adding the BlueprintLock header and calculating the correct hash.\n    *   `scaffoldDirectories(baseDir: string): void`: Creates necessary empty directories.\n*   **Data Flows:** Reads source files (ARCHITECTURE_SPEC, initial contracts, context, DSL, templates) from an input directory. Writes structured files (contracts, IDLs, interfaces, context, DSL, templates) into the designated repository directory.\n*   **Key Algorithms:**\n    *   **DAG Cycle Detection:** Standard graph traversal algorithms like Depth First Search (DFS) with state tracking (visiting, visited) can detect cycles efficiently.\n    *   **BlueprintLock Hashing:** Requires a specific procedure: read file content *without* the header, calculate hash, format header line, prepend header to content, calculate final hash of *total* content, replace header's placeholder hash with the final hash, write file.\n*   **Design Patterns:**\n    *   **Builder:** The IBA acts as a builder, constructing the initial repository structure step-by-step.\n    *   **Validator:** Encapsulates validation logic for contracts, DAG, etc.\n\n### 3.2. Task Runner (Main Process)\n\n*   **Responsibilities:**\n    *   Discover all module names by enumerating `contracts/*.json` files in the initialized repository.\n    *   Read the concurrency limit from the `IRONCLAD_MAX_PARALLEL` environment variable (defaulting to 1).\n    *   Manage a pool of active Job processes, respecting the concurrency limit.\n    *   For each module:\n        *   Create an isolated workspace directory (`.tmp/ironclad_tasks/<ModuleName>/`).\n        *   Copy or symlink required files into the workspace (module's contract, dependency contracts, IDLs, context, DSL spec, module's interface stub, dependency interface stubs). Use symlinks where possible to save space and time, ensuring the Job reads the canonical source files (besides its own temporary outputs).\n        *   Construct the `prompt.txt` file within the workspace by populating `prompt_templates/module_prompt.tmpl` with data from the workspace files.\n        *   Calculate and save the SHA-256 hash of the generated `prompt.txt` to `prompt.hash` in the workspace.\n        *   Spawn a new Job process within this isolated workspace.\n    *   Monitor spawned Job processes, waiting for their termination.\n    *   Aggregate results upon Job completion:\n        *   If a Job succeeds (no `final_failure.json` and generated files exist), copy the validated `src/modules/<ModuleName>.ts` and `src/modules/__tests__/<ModuleName>.test.ts` from the workspace to their canonical paths in the main repository.\n        *   If a Job fails (`final_failure.json` exists), record the path to this file.\n    *   After all Jobs complete, collate all individual `final_failure.json` reports into a single top-level `.ironclad_failures.json` file.\n    *   Execute global validation steps on the fully merged repository (full `tsc --noEmit`, global DSL validators, run integration tests).\n    *   Determine the final exit status: non-zero if `.ironclad_failures.json` exists or global validation fails; zero otherwise.\n*   **APIs (Internal Contracts):**\n    *   `discoverModules(contractsDir: string): string[]`: Finds all module names.\n    *   `prepareWorkspace(moduleName: string, repoDir: string, workspaceBaseDir: string, contracts: Map<string, ModuleContract>): string`: Creates and populates the workspace directory, returns its path.\n    *   `constructPrompt(workspaceDir: string, templatePath: string): void`: Generates and writes `prompt.txt` and `prompt.hash`.\n    *   `spawnJob(workspaceDir: string, jobScriptPath: string): ChildProcess`: Creates and starts a new process for a Job.\n    *   `awaitJobs(jobs: ChildProcess[]): Promise<JobResult[]>`: Waits for all job processes to exit and collects their status.\n    *   `mergeOutputs(jobResults: JobResult[], repoDir: string, workspaceBaseDir: string): void`: Copies successful outputs and collates failure report paths.\n    *   `collateFailureReports(failureReportPaths: string[], repoDir: string): void`: Combines individual failure reports.\n    *   `runGlobalValidation(repoDir: string): boolean`: Executes final validation checks.\n*   **Data Flows:** Reads contract and support files from the main repository. Writes task-specific files into workspace directories. Reads results from workspace directories. Writes generated code and consolidated failure reports back to the main repository.\n*   **Key Algorithms:**\n    *   **Concurrency Management:** Using a queue and tracking active job count to limit parallel execution based on `IRONCLAD_MAX_PARALLEL`.\n    *   **File/Directory Management:** Efficiently copying or symlinking files into workspaces.\n*   **Design Patterns:**\n    *   **Orchestrator:** The Task Runner coordinates the execution of multiple, independent Job tasks.\n    *   **Worker Pool:** Manages a pool of Job processes to control concurrency.\n\n### 3.3. Job (Worker Process)\n\n*   **Responsibilities:**\n    *   Operate entirely within its dedicated workspace directory (`.tmp/ironclad_tasks/<ModuleName>/`).\n    *   Read the `prompt.txt` and `prompt.hash` files in the workspace. Verify the hash matches the content.\n    *   Manage the retry loop for IMG invocation and validation (maximum 3 attempts).\n    *   Invoke the IMG (external LLM API call) with the current `prompt.txt`.\n    *   Receive the JSON response from the IMG (`{ implementationCode: string, testCode: string }`).\n    *   Execute the detailed validation sequence on the generated code:\n        *   **JSON Schema Validation:** Check if the IMG response is valid JSON matching the expected structure.\n        *   **TypeScript Compilation:** Write `implementationCode` to `<ModuleName>.ts` and run `tsc --noEmit` targeting this file and the corresponding `I<ModuleName>.ts` (present in the workspace), ensuring type compatibility.\n        *   **DSL Rule Validation:** Run configured validation engines (`validation_dsl_spec.md`) against the generated code (`<ModuleName>.ts`). This might involve parsing the code (AST) and applying rules defined in the DSL spec.\n        *   **Edge Case String Check:** If the module's contract (`contracts/<ModuleName>.json`) has an `instructions.edgeCases` array, check if the generated `testCode` string contains *literal strings* matching each entry in this array. This is a simple heuristic to encourage the LLM to generate tests covering specific scenarios requested in the contract.\n        *   **Test Execution:** Write `testCode` to `__tests__/<ModuleName>.test.ts` and run the test runner (e.g., `jest __tests__/<ModuleName>.test.ts`) in isolation.\n    *   If any validation step fails:\n        *   Append details of the failure (validation type, errors) to a `failures.json` file within the workspace.\n        *   Increment the attempt counter.\n        *   Amend the `prompt.txt` file by appending a deterministic error message section detailing the *specific* validation failures encountered.\n        *   If attempts < 3, loop back to invoke IMG with the amended prompt.\n        *   If attempts = 3 and validation still fails, write a `final_failure.json` file containing the accumulated failures and terminate.\n    *   If all validation steps pass on any attempt:\n        *   Write the validated `implementationCode` to `<ModuleName>.ts` and `testCode` to `__tests__/<ModuleName>.test.ts` within the workspace.\n        *   Terminate successfully (exit code 0).\n*   **APIs (Internal/External Interactions):**\n    *   `callIMG(prompt: string): Promise<{ implementationCode: string, testCode: string }>`: Makes the API call to the IMG. Handles API key management securely (e.g., reading from environment).\n    *   `runValidation(code: string, testCode: string, moduleName: string, workspaceDir: string, contract: ModuleContract): Promise<ValidationResult[]>`: Orchestrates the sequence of validation checks.\n*   **Data Flows:** Reads configuration and prompt data from its workspace. Sends prompt data to the IMG API. Receives code/test data from the IMG API. Writes temporary code/test files and failure reports within its workspace.\n*   **Key Algorithms:**\n    *   **Retry Logic:** Implementing the fixed 3-attempt loop with prompt amendment.\n    *   **Validation Orchestration:** Sequencing and interpreting results from multiple external validation tools/scripts.\n    *   **Prompt Amendment:** Deterministically adding failure context to the prompt for retries.\n*   **Design Patterns:**\n    *   **State Machine:** The Job follows a state machine: Start -> Call IMG -> Validate -> (Success -> Exit) or (Failure -> Append Failures -> Amend Prompt -> (Attempts < 3 -> Call IMG) or (Attempts = 3 -> Write Final Failure -> Exit)).\n    *   **Strategy:** The validation sequence can be seen as applying multiple validation strategies.\n\n### 3.4. Ironclad Module Generator (IMG)\n\n*   **Responsibilities:**\n    *   Accept a text prompt as input.\n    *   Utilize an underlying LLM to generate two distinct code strings based on the prompt: one for the module implementation and one for its unit tests.\n    *   Return the generated code strings packaged in a specific JSON format: `{ \"implementationCode\": \"...\", \"testCode\": \"...\" }`.\n*   **APIs (External Interface):**\n    *   An HTTP POST endpoint (or SDK call) expecting a JSON payload like `{ \"prompt\": \"...\" }`.\n    *   Returns a JSON payload like `{ \"implementationCode\": \"string\", \"testCode\": \"string\" }` upon success (HTTP 200).\n    *   Returns appropriate HTTP error codes (e.g., 400 for bad request, 401/403 for auth, 429 for rate limit, 500 for internal errors).\n*   **Data Flows:** Receives text prompt. Returns JSON object containing two string fields.\n*   **Key Algorithms:** Relies on the underlying LLM's internal architecture and training data. The system *calling* the IMG does not control this, only the prompt input.\n*   **Design Patterns:**\n    *   **Facade:** The IMG API acts as a facade over the potentially complex interaction with the raw LLM.\n\n### 3.5. Validation Engines\n\n*   **Responsibilities:**\n    *   Execute specific checks on generated code/tests.\n    *   Each engine focuses on a single type of validation (type checking, DSL rules, test execution, string matching).\n    *   Report success or detailed failure information (line numbers, error messages) in a machine-readable format.\n*   **APIs (Internal Interface - invoked by Job):**\n    *   Scripts or library functions callable from the Job process.\n    *   E.g., `runTsc(filePath: string, interfacePath: string): Promise<ValidationResult>`\n    *   E.g., `runDslValidation(code: string, rulesSpec: string): Promise<ValidationResult[]>`\n    *   E.g., `runTests(testFilePath: string): Promise<ValidationResult>`\n    *   E.g., `checkEdgeCases(testCode: string, edgeCases: string[]): Promise<ValidationResult[]>`\n*   **Data Flows:** Read generated code/test files and relevant specification files (interfaces, DSL spec, contract). Produce validation result objects.\n*   **Key Algorithms:** Depends on the specific engine (e.g., AST parsing for DSL, compiler logic for tsc, test runner logic for Jest).\n*   **Design Patterns:**\n    *   **Strategy:** Each validation engine implements a specific validation strategy.\n\n## 4. Data Model and Database Design\n\nThe Ironclad Code Generation System is designed to be largely stateless between runs, with its entire \"state\" residing within the file system of the repository and temporary workspaces. It does *not* rely on a traditional relational database (like PostgreSQL, MySQL) or a NoSQL database (like MongoDB, Cassandra) for its core operation or to persist long-term state about generation tasks or modules.\n\nThe file system itself serves as the de facto \"database\" or data store for the system's inputs, intermediate artifacts, and outputs.\n\n**Core Data Entities (File Types):**\n\n1.  **ARCHITECTURE_SPEC:**\n    *   **Purpose:** Defines the overall system, lists modules, provides high-level context.\n    *   **Format:** Markdown (`.md`).\n    *   **Attributes:** System name, description, list of modules, potentially high-level relationships.\n    *   **Relationships:** Implicitly links to all module contracts listed within it.\n2.  **Module Contracts:**\n    *   **Purpose:** Formally define the interface, dependencies, and generation instructions for a single module.\n    *   **Format:** JSON (`contracts/<ModuleName>.json`).\n    *   **Attributes:**\n        *   `moduleName` (string): Unique identifier.\n        *   `description` (string): Human-readable purpose.\n        *   `interfaceDefinition` (object): Structure defining input/output types (can reference types in `idl/`).\n        *   `dependencies` (string[]): List of other `ModuleName`s this module depends on (used for DAG and workspace prep).\n        *   `instructions` (object): Specific guidance for the IMG.\n            *   `functionalDescription` (string): Detailed behavior description.\n            *   `edgeCases` (string[]): List of specific scenarios the tests *must* mention as string literals.\n            *   `generationHints` (string): Any specific coding style, library preference hints for the LLM.\n    *   **Relationships:** Directed graph structure defined by the `dependencies` array.\n3.  **IDL Files:**\n    *   **Purpose:** Define shared data structures (types, enums, interfaces) used across multiple module contracts and implementations.\n    *   **Format:** TypeScript (`idl/*.ts`).\n    *   **Attributes:** Type definitions using TypeScript syntax.\n    *   **Relationships:** Referenced by `interfaceDefinition` within Module Contracts and used by generated code.\n4.  **System Context:**\n    *   **Purpose:** Provides global context to the IMG, such as common utility libraries, architectural principles, or domain-specific jargon definitions.\n    *   **Format:** JSON (`system_context.json`).\n    *   **Attributes:** Arbitrary key-value pairs or structured data relevant to all modules.\n5.  **Validation DSL Specification:**\n    *   **Purpose:** Defines the rules that generated code must satisfy beyond type-checking and test execution.\n    *   **Format:** Markdown (`validation_dsl_spec.md`).\n    *   **Attributes:** Description of the DSL syntax and the specific rules to be enforced (e.g., \"No 'any' types allowed\", \"All public functions must have JSDoc\", \"Specific forbidden library calls\").\n6.  **Prompt Templates:**\n    *   **Purpose:** Define the structure and phrasing used to construct the prompt sent to the IMG.\n    *   **Format:** Plain Text (`prompt_templates/*.tmpl`).\n    *   **Attributes:** Template syntax (e.g., Handlebars, Jinja) referencing variables populated from contracts, IDLs, context, and DSL spec.\n7.  **Interface Stubs:**\n    *   **Purpose:** TypeScript interface files (`src/modules/I<ModuleName>.ts`) generated by the IBA, representing the contract surface of a module. Used by `tsc` validation to ensure generated implementation code adheres to the interface.\n    *   **Format:** TypeScript (`src/modules/I*.ts`).\n    *   **Attributes:** TypeScript interface definitions.\n    *   **Relationships:** Corresponds to a Module Contract; referenced by the generated implementation code and its dependents.\n8.  **Generated Implementation Code & Tests:**\n    *   **Purpose:** The actual source code and unit tests produced by the IMG and validated by the Job.\n    *   **Format:** TypeScript (`src/modules/<ModuleName>.ts`, `src/modules/__tests__/<ModuleName>.test.ts`).\n    *   **Attributes:** Valid TypeScript code.\n    *   **Relationships:** The implementation file must implement its corresponding interface stub (`I<ModuleName>.ts`); tests exercise the implementation.\n9.  **Failure Reports:**\n    *   **Purpose:** Record detailed information about validation failures for individual Jobs and the final aggregated status.\n    *   **Format:** JSON (`.tmp/ironclad_tasks/<ModuleName>/failures.json`, `.tmp/ironclad_tasks/<ModuleName>/final_failure.json`, `.ironclad_failures.json`).\n    *   **Attributes:** Array of failure entries, each including:\n        *   `attempt` (number)\n        *   `timestamp` (string)\n        *   `validator` (string: \"json-schema\", \"tsc\", \"dsl\", \"edge-case\", \"test-runner\")\n        *   `message` (string): Error description.\n        *   `details` (object): Specific error details (e.g., compiler errors with line/column, test runner output).\n    *   **Relationships:** `final_failure.json` aggregates entries from `failures.json` for a single job. `.ironclad_failures.json` aggregates `final_failure.json` from all failed jobs.\n\n**File System Structure as the \"Schema\":**\n\nThe directory structure imposes a logical schema:\n*   `contracts/`: Module contracts.\n*   `idl/`: Shared interface definitions.\n*   `system_context.json`: Global context.\n*   `validation_dsl_spec.md`: Validation rules.\n*   `prompt_templates/`: Templates for IMG prompts.\n*   `src/modules/`: Contains `I*.ts` stubs (generated by IBA) and ultimately `*.ts` implementation files (generated by IMG/Task Runner).\n*   `src/modules/__tests__/`: Contains `*.test.ts` files (generated by IMG/Task Runner).\n*   `.tmp/ironclad_tasks/`: Temporary workspaces for Jobs. Each subdirectory `<ModuleName>/` contains task-specific files:\n    *   `contracts/<ModuleName>.json` (link/copy)\n    *   `contracts/<DependencyName>.json` (links/copies)\n    *   `idl/` (link/copy)\n    *   `system_context.json` (link/copy)\n    *   `validation_dsl_spec.md` (link/copy)\n    *   `src/modules/I<ModuleName>.ts` (link/copy)\n    *   `src/modules/I<DependencyName>.ts` (links/copies)\n    *   `prompt_templates/module_prompt.tmpl` (link/copy)\n    *   `prompt.txt` (generated by Task Runner)\n    *   `prompt.hash` (generated by Task Runner)\n    *   `task.pid` (written by Job)\n    *   `failures.json` (written by Job during retries)\n    *   `final_failure.json` (written by Job on permanent failure)\n    *   `<ModuleName>.ts` (written by Job, temp)\n    *   `__tests__/<ModuleName>.test.ts` (written by Job, temp)\n*   `.ironclad_failures.json`: Aggregated failure report (written by Task Runner).\n\n**Database Technology Rationale:**\n\nGiven that the system's data is entirely configuration, specification, code, and logs/reports, all managed within the file system and version control (Git), a dedicated database system (SQL or NoSQL) is unnecessary and would introduce undue complexity, overhead, and external dependencies. The file system provides sufficient structure, persistence, and access control for this use case. The requirements for the system's internal state (primarily the collection of files at different stages) are well-suited to file-based storage. CAP theorem considerations are not relevant here, as the system operates on local files within a single execution context, not a distributed data store. Consistency is ensured by the deterministic pipeline and validation steps operating on immutable file inputs for each stage.\n\n**Data Management Strategies:**\n\n*   **Versioning:** Handled entirely by Git for all source files (contracts, IDLs, specs, templates) and generated code.\n*   **Immutability:** Input files for the Task Runner (generated by IBA) are treated as immutable during the generation process. The `BlueprintLock` header reinforces this for IBA outputs.\n*   **Isolation:** Workspaces provide data isolation for individual generation Jobs, preventing interference.\n*   **Cleanup:** Temporary workspace directories (`.tmp/ironclad_tasks/`) should be cleaned up after the Task Runner completes, regardless of success or failure, to conserve disk space.\n\n## 5. API Design and Endpoints (Public/External)\n\nThe Ironclad Code Generation System is primarily a command-line interface (CLI) tool designed to be integrated into development workflows and CI/CD pipelines. It does not expose a traditional web-based REST API for its core generation process. Its public interface is the command-line entry point and the structure/content of the files it reads and writes.\n\nHowever, it *interacts* with an external API for the Ironclad Module Generator (IMG). This interaction is an internal detail of the Job process, but the specification of the IMG API endpoint is crucial for understanding the system's external dependencies.\n\n**Public Interface (CLI):**\n\nThe system is invoked via a command-line command, potentially with subcommands for the different phases.\n\n*   **Command Structure:**\n    ```bash\n    ironclad <command> [options]\n    ```\n*   **IBA Command:**\n    ```bash\n    ironclad blueprint build <architecture-spec-path> --output <repository-path>\n    ```\n    *   **Purpose:** Executes the Ironclad Blueprint Architect phase.\n    *   **Inputs:**\n        *   `<architecture-spec-path>` (string, required): Path to the main `ARCHITECTURE_SPEC.md` file.\n        *   `--output <repository-path>` (string, required): Directory where the repository skeleton will be created/initialized.\n        *   `--contracts-dir <path>` (string, optional): Directory containing initial module contracts (default: relative to spec path).\n        *   `--idls-dir <path>` (string, optional): Directory containing initial IDL files (default: relative to spec path).\n        *   `--context-file <path>` (string, optional): Path to initial `system_context.json` (default: relative to spec path).\n        *   `--dsl-file <path>` (string, optional): Path to initial `validation_dsl_spec.md` (default: relative to spec path).\n        *   `--template-dir <path>` (string, optional): Directory containing initial prompt templates (default: relative to spec path).\n    *   **Outputs:**\n        *   Creates/populates the directory structure at `<repository-path>` with all non-implementation files including BlueprintLock headers.\n        *   Standard output/error stream for progress, validation errors (especially DAG cycles).\n        *   Exit code 0 on success, non-zero on failure.\n*   **Task Runner Command:**\n    ```bash\n    ironclad generate run <repository-path>\n    ```\n    *   **Purpose:** Executes the Task Runner code generation and validation phase.\n    *   **Inputs:**\n        *   `<repository-path>` (string, required): Path to the repository directory initialized by the IBA.\n        *   Environment Variable: `IRONCLAD_MAX_PARALLEL` (integer, optional): Maximum number of concurrent Jobs (default: 1).\n        *   Environment Variable: `IMG_API_KEY` (string, required for IMG interaction): API key for authentication with the IMG endpoint.\n        *   Environment Variable: `IMG_API_URL` (string, required for IMG interaction): URL of the IMG endpoint.\n    *   **Outputs:**\n        *   Modifies files within `<repository-path>` by adding successfully generated `src/modules/*.ts` and `src/modules/__tests__/*.test.ts`.\n        *   Writes `.ironclad_failures.json` at the top level of `<repository-path>` if any Job or global validation failed.\n        *   Standard output/error stream for Task Runner progress, Job status updates, and global validation results.\n        *   Exit code 0 on success (all modules generated/validated, global validation passed), non-zero on failure.\n\n**External API (IMG Interaction - Internal to System):**\n\nThe Job process interacts with the IMG, which is treated as an external service. The specific API contract is as follows:\n\n*   **Endpoint:** Configurable via `IMG_API_URL` environment variable. Assumed to be a single POST endpoint, e.g., `POST /generate`.\n*   **HTTP Method:** `POST`.\n*   **Request Format (JSON):**\n    ```json\n    {\n      \"prompt\": \"string\"\n    }\n    ```\n    *   `prompt`: The detailed text prompt generated by the Task Runner for a specific module, containing instructions, context, interfaces, etc.\n*   **Request Headers:**\n    *   `Content-Type: application/json`\n    *   `Authorization: Bearer <IMG_API_KEY>` (Example using bearer token, actual scheme depends on IMG provider, could be custom header `X-IMG-API-Key`). The API key is read from `IMG_API_KEY` environment variable by the Job.\n*   **Response Format (JSON):**\n    ```json\n    {\n      \"implementationCode\": \"string\",\n      \"testCode\": \"string\"\n    }\n    ```\n    *   `implementationCode`: The generated TypeScript source code for the module implementation.\n    *   `testCode`: The generated TypeScript source code for the module's unit tests.\n*   **HTTP Status Codes:**\n    *   `200 OK`: Successfully generated code. Response body contains the JSON payload.\n    *   `400 Bad Request`: Prompt was invalid or malformed.\n    *   `401 Unauthorized`: Invalid or missing API key.\n    *   `403 Forbidden`: API key lacks necessary permissions.\n    *   `429 Too Many Requests`: Rate limit exceeded.\n    *   `500 Internal Server Error`: An error occurred within the IMG service (e.g., LLM failure).\n    *   Other 4xx/5xx codes for specific errors.\n*   **Authentication:** Token-based authentication using an API key passed via an HTTP header.\n*   **Versioning:** Assumed to be handled by the IMG service itself (e.g., endpoint path `/v1/generate`). The Task Runner would be configured with the specific versioned URL via `IMG_API_URL`. The system's reliance on prompt structure implies a strong coupling to the specific IMG model/version it was developed against. Changes to the IMG might require updates to prompt templates and validation logic.\n*   **Rate Limiting:** Expected to be enforced by the IMG provider. The Task Runner manages *local* concurrency (`IRONCLAD_MAX_PARALLEL`), but the IMG provider might have its own limits. The Job process should ideally implement exponential backoff and retry for 429 errors if the IMG API supports it, though the current spec only mentions retries for generation/validation failures (which *might* stem from IMG errors). The Job's 3-attempt limit implicitly handles persistent IMG failures.\n\nThis design clearly separates the public CLI interface for system users from the internal API interaction with the external IMG service.\n\n## 6. User Interface (UI) and User Experience (UX) Design\n\nThe Ironclad Code Generation System operates primarily as a backend tool without a dedicated graphical user interface (GUI). Its \"UI\" is the command line interface (CLI) and the file system structure of the repository. The \"UX\" is centered around ease of command execution, clarity of output (console and files), predictability of file locations, and the overall developer workflow integration.\n\n**User Personas:**\n\n1.  **Architect/System Designer:**\n    *   **Goals:** Define the system structure, module boundaries, contracts, and validation rules using ARCHITECTURE_SPEC, contracts, IDLs, system context, and DSL spec files. Ensure architectural compliance and consistency across modules.\n    *   **Interaction:** Primarily interacts with the system by creating and modifying input files in the repository, running the `ironclad blueprint build` command, and reviewing the initial repository structure generated by the IBA.\n2.  **Module Developer:**\n    *   **Goals:** Focus on implementing specific domain logic, potentially writing manual code where LLM generation is insufficient. Review generated code for correctness, efficiency, and adherence to requirements. Debug validation failures reported by the system.\n    *   **Interaction:** Creates/modifies module contracts (`contracts/*.json`) and related IDLs (`idl/*.ts`). Runs the `ironclad generate run` command (often implicitly via CI). Reviews the generated `src/*.ts` and `src/__tests__/*.test.ts` files. Reads the `.ironclad_failures.json` report to understand why a module failed generation/validation and potentially debug/amend the prompt or contracts.\n3.  **CI/CD Engineer:**\n    *   **Goals:** Integrate the Ironclad system into the automated build pipeline. Ensure successful execution, monitor for failures, and report status. Manage environment configuration (like `IRONCLAD_MAX_PARALLEL`, `IMG_API_KEY`).\n    *   **Interaction:** Configures build scripts to run `ironclad blueprint build` followed by `ironclad generate run` on relevant commits. Monitors standard output/error, checks the process exit code, and makes the `.ironclad_failures.json` report available in the CI dashboard.\n4.  **Validation Rule Author:**\n    *   **Goals:** Define and refine validation rules in the `validation_dsl_spec.md` to enforce coding standards, security policies, or architectural constraints.\n    *   **Interaction:** Creates/modifies `validation_dsl_spec.md`. Relies on the system's validation engines to correctly interpret and apply these rules during the `ironclad generate run` phase.\n\n**User Flows/Journeys:**\n\n1.  **Initial System Setup:**\n    *   Architect defines initial ARCHITECTURE_SPEC, core contracts, IDLs, context, DSL spec, prompt templates.\n    *   Architect runs `ironclad blueprint build <spec> --output <repo>`.\n    *   System validates inputs (e.g., DAG).\n    *   System scaffolds repository, generates interface stubs, adds BlueprintLocks.\n    *   Architect reviews generated repository structure and interface stubs.\n2.  **Generating Initial Modules:**\n    *   Architect/Developer ensures contracts are complete.\n    *   CI/CD pipeline or Developer runs `ironclad generate run <repo>` (with `IRONCLAD_MAX_PARALLEL` set).\n    *   Task Runner discovers modules, prepares workspaces, spawns Jobs.\n    *   Jobs invoke IMG, run validation loop.\n    *   Task Runner aggregates results.\n    *   If successful, generated code is merged. CI/CD reports success.\n    *   If failures, Task Runner writes `.ironclad_failures.json`. CI/CD reports failure.\n    *   Developer reviews `.ironclad_failures.json` to identify failed modules and reasons.\n3.  **Iterating on Failed Modules:**\n    *   Developer reads `final_failure.json` (collated in `.ironclad_failures.json`).\n    *   Developer modifies the contract (`contracts/<ModuleName>.json`) or potentially the `system_context.json` or `validation_dsl_spec.md` to guide the LLM or adjust rules. *Note: Directly editing the prompt.txt or generated code is against the system's philosophy; inputs (contracts, context, rules, templates) should be modified to influence output.*\n    *   Developer commits changes.\n    *   CI/CD pipeline runs `ironclad blueprint build` (to regenerate interface stubs if contracts changed, and update BlueprintLocks) and then `ironclad generate run`.\n    *   Repeat until module generation and validation pass.\n4.  **Adding New Modules or Features:**\n    *   Architect defines new module contract(s) and updates ARCHITECTURE_SPEC. Adds/updates IDLs if needed.\n    *   Developer commits changes.\n    *   CI/CD runs the full pipeline.\n\n**Conceptual Wireframes/Mockups (Described):**\n\n*   **CLI Output:**\n    *   Progress indicators (e.g., `[IBA] Validating contracts... OK`, `[IBA] Scaffolding repository... OK`).\n    *   Task Runner startup: `Discovering modules... Found 15 modules.`\n    *   Job spawning: `[Task Runner] Spawning job for UserService (PID 12345)`\n    *   Job status updates (if implemented, e.g., via logging): `[Job UserService] Attempt 1: Calling IMG...`, `[Job UserService] Attempt 1: Validation failed (tsc error). Retrying...`, `[Job ProductService] Attempt 1: Validation successful. Merging output.`\n    *   Task Runner aggregation: `[Task Runner] All jobs completed. 12 successful, 3 failed.`\n    *   Global validation: `[Task Runner] Running global validation (full tsc)... OK.`, `[Task Runner] Running global validation (integration tests)... FAILED.`\n    *   Final summary: `BUILD FAILED. See .ironclad_failures.json for details.` or `BUILD SUCCESSFUL.`.\n*   **`.ironclad_failures.json` Structure:** A clear, well-formatted JSON array, easy for machines to parse and humans to read, listing failures grouped by module, attempt, and validation step, including error messages and potentially code snippets or line numbers.\n\n**UI Technology Choices:**\n\n*   **CLI Framework:** A Node.js CLI framework (e.g., Commander, Oclif, Yargs) to handle command parsing, options, help messages, and colored output.\n*   **Output Formatting:** Standard console logging (`console.log`, `console.error`) for basic progress and status. Libraries for structured logging and potentially richer console output (e.g., spinners, progress bars for Job execution) could enhance UX. JSON formatting libraries for `.ironclad_failures.json`.\n\n**State Management:**\n\nThe system is largely stateless between command invocations. The \"state\" is the file system contents. Within a single `ironclad generate run` execution, the Task Runner manages the state of the generation process:\n*   List of modules to process.\n*   Queue of modules awaiting generation.\n*   List of active Jobs.\n*   Tracking of completed Jobs (success/failure).\n*   Accumulation of failure report paths.\n\nThis state is managed in memory by the Task Runner process and discarded upon completion. Job processes manage their own state within their retry loop (attempt counter, accumulated failures) using in-memory variables and the `failures.json` file in their workspace.\n\n**Usability, Accessibility, Responsive Design:**\n\n*   **Usability:** Focused on clarity of CLI commands, predictable file inputs/outputs, informative console messages, and a well-structured failure report file that facilitates debugging. The isolation of jobs makes debugging individual module failures easier (inspecting the workspace).\n*   **Accessibility:** As a CLI tool, traditional accessibility concerns (screen reader compatibility with graphical elements) are not applicable. Output is text-based, suitable for standard terminal access. Ensuring clear, concise language in messages and documentation is key for cognitive accessibility.\n*   **Responsive Design:** Not applicable to a CLI tool. Performance considerations relate to execution time and resource usage, not adapting to different screen sizes.\n\n## 7. Authentication and Authorization Strategy\n\nThe Ironclad Code Generation System's authentication and authorization needs are relatively simple compared to a multi-user, web-facing application. The system primarily operates within a controlled environment (developer machine or CI/CD runner) and its security model is built around file system permissions and secure handling of credentials for external services.\n\n**Authentication:**\n\n*   **System Users (Developers, CI/CD):** The system itself does not implement user authentication. Access to run the `ironclad` commands and modify the input/output files is controlled by the operating system's file permissions and the version control system (Git) access controls. Users are implicitly authenticated by their ability to log in to the machine or CI environment and interact with the repository files.\n*   **IMG API:** The *most critical* authentication requirement is for the Job processes to securely authenticate with the external Ironclad Module Generator (IMG) API.\n    *   **Mechanism:** The IMG API is expected to use an API key or token-based authentication. The specific scheme (e.g., Bearer token in `Authorization` header, custom header like `X-IMG-API-Key`) depends on the IMG provider.\n    *   **Credential Management:** The IMG API key (`IMG_API_KEY`) MUST NOT be hardcoded in source code or configuration files checked into version control. It MUST be provided to the `ironclad generate run` process securely, typically via environment variables or a secret management system integrated into the CI/CD environment (e.g., HashiCorp Vault, AWS Secrets Manager, Kubernetes Secrets, GitHub Actions Secrets, GitLab CI/CD Variables).\n    *   **Implementation:** The Job process, when making the `callIMG` API request, will read the `IMG_API_KEY` environment variable (or fetch it from a configured secret source) and include it in the appropriate request header.\n\n**Authorization:**\n\n*   **System Users:** Authorization is managed by the underlying OS and Git permissions. Users who have write access to the repository can run the tools and modify files. Users with read access can run the tools and view inputs/outputs but not modify them in the repository.\n*   **IMG API:** The IMG API key/token should ideally have the *least privilege* necessary. Its *only* authorized action should be to invoke the code generation endpoint (`/generate`). It should not have permissions to access other services or data within the IMG provider's infrastructure. This principle of least privilege limits the blast radius if a key is compromised. The IMG service itself is responsible for enforcing this authorization based on the provided key.\n*   **Internal System Authorization:** Within the Ironclad system processes (IBA, Task Runner, Job), authorization is implicit based on the process's identity and the file system permissions of the user running the command.\n    *   The Task Runner and Jobs need read/write access to the `.tmp/ironclad_tasks/` directory and read/write access to the main repository directory (`<repository-path>`) to read inputs, write outputs, and merge results.\n    *   The IBA needs write access to create/initialize the repository directory.\n\n**Identity Provider Integration:**\n\nNo external identity provider (like Okta, Auth0, Active Directory Federation Services) is required for the Ironclad system itself, as it doesn't manage user identities or logins. The system relies on the identity context provided by the execution environment (the user running the command, the CI/CD runner's identity).\n\n**Permissions Enforcement:**\n\n*   **File System:** The operating system enforces read/write permissions on files and directories.\n*   **Git:** Git hosting platforms enforce push/pull permissions on the repository.\n*   **IMG API:** The IMG provider enforces authorization based on the API key presented with each request.\n*   **Within Ironclad:** The system's components rely on each other's outputs being available in the file system and trust that they are operating under sufficient permissions granted by the execution environment. There is no internal permission layer between the IBA, Task Runner, and Job processes beyond the file system.\n\n**Secure Credential Handling:**\n\n*   API keys MUST NOT be stored directly in configuration files or the repository.\n*   Environment variables are the minimal acceptable mechanism for passing secrets in automated environments.\n*   Integration with dedicated secret management systems is the recommended best practice for production CI/CD pipelines.\n*   The Job process should load the key from the environment variable *just before* making the API call and avoid logging the key value.\n\nIn summary, the security model is focused on securing access to the repository files via standard OS/Git controls and, crucially, handling the external IMG API key with robust secret management practices.\n\n## 8. Security Considerations and Threat Model\n\nDeveloping an automated code generation system that interacts with potentially untrusted inputs (developer-provided specifications, external LLMs) and produces executable code necessitates a strong focus on security. The threat model considers potential vulnerabilities throughout the pipeline.\n\n**Threat Model (STRIDE/DREAD applied to key components):**\n\n| Threat Category    | Description                                                                                                | Affected Components     | Potential Impact                                                                   |\n| :----------------- | :--------------------------------------------------------------------------------------------------------- | :---------------------- | :--------------------------------------------------------------------------------- |\n| **Spoofing**       | Forging BlueprintLock hashes to disguise tampering.                                                        | IBA, Task Runner (Validation) | Compromised integrity verification, allowing malicious changes to inputs or outputs. |\n| **Tampering**      | Modifying input files (specs, contracts, templates) after IBA processing but before/during Task Runner execution. | Repository Files        | Injecting malicious instructions, altering contracts, breaking validation rules.   |\n|                    | Modifying generated code/tests within a workspace before validation.                                     | Task Workspace          | Bypassing validation, injecting vulnerabilities into final code.                   |\n|                    | Modifying the IMG API response before it reaches the Job.                                                | IMG API Call            | Injecting malicious code, invalid code.                                            |\n| **Repudiation**    | Denying that a specific generation run produced certain code.                                              | Entire System           | Difficulty auditing code origin and changes.                                       |\n| **Information Disclosure** | Leaking sensitive information (e.g., IMG API keys, internal system details) via logs or files.            | Job, Task Runner, Logs  | Compromise of external accounts, exposure of internal architecture.                |\n| **Denial of Service** | Providing overly complex inputs (large contracts, deep dependency graphs) consuming excessive resources.   | IBA, Task Runner        | Slowing down or crashing the system.                                               |\n|                    | Triggering excessive IMG API calls (rate limits, costs).                                                   | Job (via Retries)       | Financial costs, service disruption.                                               |\n|                    | Generating enormous code files causing storage/memory issues.                                              | IMG, Job, Task Runner   | System instability, disk filling.                                                  |\n| **Elevation of Privilege** | Generating code that, when run later, exploits vulnerabilities in its execution environment.               | IMG (Code Output)       | Depends on deployment environment; standard code execution risks.                  |\n|                    | Exploiting vulnerabilities in the Ironclad tool itself to gain unauthorized access.                      | IBA, Task Runner, Job   | Compromise of the build environment.                                               |\n\n**OWASP Top 10 (Applied to the concept):**\n\nWhile not a web application, certain principles apply:\n*   **A01: Broken Access Control:** Relevant to file system permissions and IMG API key scope.\n*   **A03: Injection:** Prompt injection into the LLM is a major risk – crafting inputs (contracts, context, templates) that manipulate the LLM into generating unintended or malicious code.\n*   **A05: Security Misconfiguration:** Improperly configured validation rules, lax file permissions, insecure handling of IMG API key.\n*   **A08: Software and Data Integrity Failures:** Lack of integrity checks on inputs/outputs, reliance on untrusted components (LLM). BlueprintLock directly addresses data integrity.\n\n**Countermeasures:**\n\n1.  **Input Validation and Sanitization:**\n    *   Rigorously validate the structure and content of all input files (ARCHITECTURE_SPEC, contracts, context, DSL spec, templates). Use JSON schema validation for contracts and context.\n    *   Sanitize any input data incorporated into the IMG prompt to minimize prompt injection risks. While complete sanitization for LLMs is hard, filter out potentially harmful control characters or excessively long/complex sequences.\n    *   Validate the dependency graph for cycles in the IBA.\n2.  **Output Validation and Static Analysis:**\n    *   The multi-step validation process within the Job is the primary defense against malicious or incorrect LLM output.\n    *   **Static Analysis:** `tsc` provides strong type safety. Implement robust DSL validation that can parse code (e.g., using Abstract Syntax Trees - ASTs) and enforce structural/syntactic rules. Integrate standard linters (ESLint, Prettier) and security linters (Semgrep, SonarQube scanner) into the validation sequence.\n    *   **Edge Case Checks:** While basic, the string literal check for edge cases encourages the LLM to include specific functional coverage in tests.\n    *   **Test Execution:** Running generated tests provides dynamic validation of functional correctness.\n    *   **Global Validation:** Full project type check and integration tests catch issues arising from inter-module dependencies or the merging process.\n3.  **Execution Isolation:**\n    *   Run each Job in a strictly isolated environment (separate process, potentially a container or sandbox). The temporary workspace directory should ideally be mounted with restricted permissions.\n    *   Limit the resources (CPU, memory, network access) available to Job processes to mitigate DoS threats from resource-hungry generations or infinite loops in tests.\n4.  **Secure Credential Management (Secrets Management):**\n    *   Use environment variables *at minimum* for non-sensitive configuration.\n    *   For sensitive credentials like the `IMG_API_KEY`, use a dedicated secret management system (HashiCorp Vault, cloud provider secrets managers) integrated into the CI/CD pipeline.\n    *   Fetch secrets just-in-time within the Job process and do not write them to disk or logs.\n5.  **Integrity Verification (BlueprintLock):**\n    *   The `BlueprintLock: sha256:<hash>` header implemented by the IBA provides a mechanism to verify that the core architectural blueprint files (contracts, IDLs, specs, templates, interface stubs) have not been tampered with after the initial build phase. The Task Runner or a separate verification tool should ideally re-check these hashes before starting generation and after merging.\n6.  **Secure Coding Practices:**\n    *   Develop the Ironclad tooling itself (IBA, Task Runner, Job logic, Validation Engines) using secure coding principles.\n    *   Perform static analysis and dependency scanning on the Ironclad tool's codebase to prevent vulnerabilities in the tooling itself.\n7.  **Logging and Monitoring:**\n    *   Implement comprehensive logging of the generation process, including prompts sent to the IMG (sanitized if necessary), IMG responses, validation results, and failure details.\n    *   Monitor system resource usage and execution times to detect potential DoS attempts or inefficient generations.\n8.  **Principle of Least Privilege:**\n    *   The user/service account running the Ironclad tools should have only the necessary file system permissions.\n    *   The IMG API key should have minimal permissions on the IMG provider's side.\n9.  **Dependency Scanning and Vulnerability Management:**\n    *   Regularly scan the Ironclad tool's dependencies for known vulnerabilities.\n    *   Implement a process for patching or updating dependencies promptly.\n10. **Deterministic Behavior:** The emphasis on determinism (given the same inputs, produce the same outputs) is a security benefit as it makes unexpected changes easier to spot and verify.\n\nBy combining rigorous input/output validation, process isolation, secure credential handling, integrity checks, and secure development practices for the tool itself, the Ironclad system can mitigate many of the inherent risks associated with automated code generation using external AI models.\n\n## 9. Scalability, Performance, and Resilience\n\nThe Ironclad Code Generation System's architecture is designed with scalability, performance, and resilience in mind, primarily within the context of a build pipeline execution.\n\n**Scalability:**\n\n*   **User Growth:** The system is not a multi-user online service, so user concurrency isn't a direct scaling concern in the traditional sense. Scalability relates to the number of modules being managed and generated by a development team or organization.\n*   **Module Growth:** The architecture scales horizontally with the number of modules by processing them in parallel. The `IRONCLAD_MAX_PARALLEL` environment variable is the primary knob for controlling this concurrency.\n*   **Data Volume:** The data volume primarily consists of source files (contracts, specs) and generated code. While this grows with the project size, it's managed by the file system and version control, which are assumed to handle large volumes. Large individual files (e.g., huge generated code files) could pose issues, but typical module sizes should be manageable.\n*   **Transaction Rates:** The \"transactions\" are module generation tasks. The system scales by increasing the rate at which these tasks are processed concurrently.\n*   **Bottlenecks:**\n    *   **LLM API Throughput/Rate Limits:** The IMG API is an external dependency and a likely bottleneck. Batching requests (if the API supports it) or simply increasing `IRONCLAD_MAX_PARALLEL` up to the API's limit are factors. High LLM latency directly impacts Job duration.\n    *   **Validation Engine Performance:** Running `tsc`, linters, test runners for each job can be CPU-intensive. Slow validation engines will bottleneck the Job completion rate.\n    *   **File I/O:** Creating/populating workspaces and merging outputs involves significant file operations, which can be a bottleneck on slow storage.\n    *   **CPU/Memory Resources:** The Task Runner and multiple concurrent Jobs consume CPU and memory. The available resources on the build machine/container limit `IRONCLAD_MAX_PARALLEL`.\n    *   **DAG Structure:** While DAG ensures no circular dependencies, a very deep or wide DAG might imply complex interdependencies that, while not blocking *generation*, could complicate *global validation* or make individual module testing/validation slower due to loading many dependencies.\n\n**Scaling Approaches:**\n\n*   **Horizontal Scaling (within a single run):** The `IRONCLAD_MAX_PARALLEL` setting enables running multiple Jobs concurrently on a single machine/runner. This is the primary built-in scaling mechanism.\n*   **Horizontal Scaling (across build agents):** For very large projects, the module set could theoretically be partitioned and assigned to different CI build agents, each running a subset of the modules using the Task Runner. The current architecture assumes a single runner, but the isolation of jobs makes this distributed approach conceptually possible with an external orchestration layer.\n*   **Vertical Scaling:** Running the Task Runner and Jobs on a more powerful machine with more CPU cores and RAM will allow increasing `IRONCLAD_MAX_PARALLEL` and potentially speed up validation steps.\n*   **Caching:**\n    *   **Dependency Caching (CI):** Standard CI practices (e.g., caching `node_modules`) apply to the Ironclad tool's dependencies and the dependencies needed by the generated code/tests.\n    *   **LLM Response Caching:** This is complex and must be done carefully. Caching LLM outputs for a given prompt hash (`prompt.hash`) could drastically speed up regeneration if inputs haven't changed. However, this breaks the direct interaction with the LLM and must be bypassable. It also requires a cache invalidation strategy if the underlying LLM model changes or is updated. *This is a potential future enhancement, not in the core design.*\n    *   **Validation Results Caching:** If a module's inputs (contract, dependencies, context, templates) and the IMG response haven't changed, and the validation engines are versioned, validation results could potentially be cached. Again, complex invalidation rules apply. *Future enhancement.*\n\n**Performance Targets:**\n\nQuantitative performance targets would be set based on project needs, e.g.:\n*   **Overall Pipeline Latency:** The time from starting `ironclad generate run` to getting a success/failure exit code. Target could be, e.g., < 10 minutes for a project of N modules.\n*   **Module Generation Throughput:** Number of modules successfully generated and validated per minute, given `IRONCLAD_MAX_PARALLEL`.\n*   **Job Latency:** Average time taken for a single Job (including retries). Target could be, e.g., < 2 minutes per module.\n*   **Validation Step Latency:** Performance targets for individual validation steps (tsc, dsl, test runner).\n\nAchieving these targets relies heavily on tuning `IRONCLAD_MAX_PARALLEL`, the performance of the chosen LLM and its API, and the efficiency of the validation engines.\n\n**Resilience:**\n\n*   **Job Isolation:** Failure in one Job (due to bad LLM output, validation error, or transient issue) does NOT affect other concurrent Jobs or the main Task Runner process. This is a core resilience mechanism.\n*   **IMG Call Retries:** The 3-attempt retry loop within each Job handles transient network issues or temporary LLM glitches. Prompt amendment helps the LLM potentially correct previous mistakes.\n*   **Failure Reporting:** The system doesn't crash silently. Failures are explicitly captured in `final_failure.json` and aggregated into `.ironclad_failures.json`, providing transparency and enabling debugging.\n*   **Deterministic Behavior:** Aids resilience by making failures reproducible and easier to diagnose.\n*   **Idempotency (Partial):** While not fully idempotent (re-running changes the repository), the Job processing *within a workspace* aims for idempotency per attempt - the same prompt to the same IMG version should ideally yield the same result, leading to deterministic validation results for that attempt. The overall process isn't fully idempotent because retries modify the prompt, and successful runs modify the repository. However, given the *same* input repository state, `ironclad generate run` should produce the *same* output repository state (including `.ironclad_failures.json`).\n*   **Task Runner Robustness:** The Task Runner needs to gracefully handle Job process crashes (non-zero exit codes, signals) and report them correctly.\n*   **BlueprintLock:** While not directly related to runtime resilience, it ensures the integrity of the *blueprint*, which is foundational for reliable generation.\n\n**High Availability / Fault Tolerance:**\n\nHA/FT concepts like failover and redundancy are not directly applicable to the Ironclad tool itself, as it's an on-demand process, not a continuously running service. Its \"availability\" is tied to the availability of the build environment (developer machine, CI runner) and the external IMG service. The resilience features ensure that a single *run* of the tool is as likely to succeed as possible, and failures are contained and reported. The CI/CD environment provides the overall fault tolerance by allowing failed builds to be retried.\n\n## 10. Deployment Strategy and Infrastructure\n\nThe Ironclad Code Generation System is designed to be deployed and executed within standard software development build environments. It is not a service requiring dedicated infrastructure like a production cluster.\n\n**CI/CD Pipeline:**\n\nThe system is intended to be a key step in the build pipeline.\n\n*   **Tools:** Compatible with common CI/CD platforms (Jenkins, GitHub Actions, GitLab CI, Azure DevOps Pipelines, CircleCI, etc.). Relies on standard build runners capable of executing shell commands, Node.js, and having access to necessary tools like `tsc`, test runners (Jest/Mocha), linters.\n*   **Stages:** A typical pipeline involving Ironclad would include:\n    1.  **Checkout:** Get the source code from the Git repository.\n    2.  **Environment Setup:** Install Node.js, Ironclad tool dependencies, validation engine dependencies (tsc, test runner, linters). Set environment variables (`IRONCLAD_MAX_PARALLEL`, `IMG_API_KEY`, `IMG_API_URL`).\n    3.  **IBA Build:** Run `ironclad blueprint build <spec> --output <repo>`. Fail the build if this step fails (e.g., DAG cycle).\n    4.  **Task Runner Generation:** Run `ironclad generate run <repo>`. This is the core generation and validation step.\n    5.  **Check Results:** Check the exit code of the Task Runner. If non-zero, fail the build.\n    6.  **(Optional) Artifacts:** Publish the `.ironclad_failures.json` file as a build artifact.\n    7.  **(Optional) Further Checks:** Run additional steps on the generated code, like security scanning, complexity analysis, deployment manifest generation (potentially using Ironclad principles for *generating* those manifests too).\n    8.  **Commit/Merge:** If the build is successful (both IBA and Task Runner passed), the generated code can be committed back to a specific branch (e.g., `generated/main`) or used directly for deployment downstream in the pipeline. *Self-correction: Automatically committing generated code back to the source branch can be problematic for Git history and merge conflicts. A common pattern is to generate code on a feature branch and include it in the PR, or generate it on a dedicated branch, or generate it as a build artifact used only for deployment.* The architecture supports generating the code *into* the working directory, making any of these post-generation steps feasible.\n\n**Hosting Environment:**\n\n*   The system runs within the build environment provided by the CI/CD platform. This can be:\n    *   **Managed Cloud CI Runners:** (e.g., GitHub Actions runners, GitLab shared runners, AWS CodeBuild).\n    *   **Self-Hosted CI Runners:** Virtual machines or physical servers managed by the organization.\n    *   **Developer Machines:** For local development and testing.\n*   Requires a compatible operating system (Linux, macOS, Windows) and sufficient resources (CPU, RAM, Disk) to support the Ironclad tool and its spawned Jobs.\n\n**Containerization (Docker):**\n\n*   **Recommendation:** Containerizing the Ironclad tool and its dependencies within a Docker image is highly recommended.\n*   **Benefits:**\n    *   **Consistency:** Ensures the same environment (Node.js version, tool versions, libraries) is used across all build agents, eliminating \"it works on my machine\" issues.\n    *   **Isolation:** Provides a clean environment for each build run, avoiding conflicts with other software on the runner.\n    *   **Simplified Setup:** Dependencies are pre-packaged in the image.\n    *   **Portability:** The Docker image can be run easily on any machine or CI platform that supports Docker.\n*   **Implementation:** A `Dockerfile` would define the base image (e.g., Node.js), install the Ironclad tool's dependencies, install validation tools (tsc, test runner, linters), and set up the entry point. The CI pipeline would pull and run this container image.\n\n**Infrastructure as Code (IaC):**\n\n*   IaC (Terraform, CloudFormation, Pulumi) is not used to deploy the Ironclad *tool* itself, as it's not a long-running service.\n*   IaC *is* relevant for provisioning the *build environment* where Ironclad runs (e.g., EC2 instances for self-hosted runners, configuring cloud CI services).\n*   Furthermore, the *output* of the Ironclad system could *include* IaC definitions or deployment manifests (e.g., Kubernetes YAML, CloudFormation templates) for the generated modules, enabling automated infrastructure provisioning for the built services. This is a potential future enhancement leveraging the generation capabilities.\n\n**Deployment Strategies for Generated Code:**\n\nThe Ironclad system focuses on generating code. The deployment of the *generated services* would follow standard practices for the chosen technology stack (e.g., building Docker images for each service, deploying to Kubernetes, Serverless functions, etc.). The Ironclad output provides the source code artifact for this process.\n\n**Environment Configuration Management:**\n\n*   **Build-time Configuration:** Configuration specific to the build process (like `IRONCLAD_MAX_PARALLEL`, paths) is managed via environment variables or command-line flags passed to the `ironclad` command.\n*   **Runtime Configuration (of generated code):** Configuration needed by the *generated services* at runtime should be handled separately, likely defined in configuration files within the repository (potentially also generated/managed by Ironclad principles) and injected into the service environment using standard practices (ConfigMaps in Kubernetes, Parameter Store, environment variables).\n\n**Blue/Green or Canary Deployment:**\n\nThese strategies are deployment patterns for the *generated services*, not the Ironclad build tool itself. The Ironclad system contributes to these strategies by providing potentially higher-quality, more consistent code artifacts.\n\nOverall, the deployment strategy for Ironclad is tightly coupled with the organization's CI/CD practices, treating the tool as a standard build dependency executed within a containerized and securely configured environment.\n\n## 11. Monitoring, Logging, and Observability\n\nEffective monitoring, logging, and observability are crucial for understanding the behavior of the Ironclad code generation pipeline, diagnosing failures, identifying performance bottlenecks, and ensuring the system is operating correctly within the CI/CD environment.\n\n**Logging Strategy:**\n\n*   **Structured Logging:** All components (IBA, Task Runner, Jobs, Validation Engines) should emit structured logs, preferably in JSON format. This makes logs easy to parse, filter, and analyze by automated systems.\n*   **Log Levels:** Use standard log levels (DEBUG, INFO, WARN, ERROR, FATAL) to control verbosity.\n*   **Contextual Information:** Logs MUST include contextual information to identify the source and related task:\n    *   `timestamp`\n    *   `level`\n    *   `component` (e.g., \"IBA\", \"TaskRunner\", \"Job\")\n    *   `message` (human-readable summary)\n    *   `taskId` (unique ID for the Task Runner run)\n    *   `module` (for Job-specific logs, the module name)\n    *   `attempt` (for Job retry loop logs)\n    *   `validationStep` (for validation engine logs)\n    *   `details` (structured object for error messages, validation output, etc.)\n*   **Log Destination:**\n    *   During local development, logs are printed to the console (stdout/stderr).\n    *   In CI/CD, logs should be captured by the CI platform's logging mechanism. Ideally, these logs are shipped to a centralized logging system (e.g., ELK stack, Splunk, Datadog Logs, CloudWatch Logs) for aggregation, search, and analysis.\n*   **Sensitive Data:** Logs MUST NOT contain sensitive information, especially the `IMG_API_KEY` or the full content of sensitive inputs/prompts unless absolutely necessary for debugging in a secure environment and with appropriate redaction. Generated code/tests might be logged at DEBUG level in workspaces but should not typically be in aggregated remote logs due to verbosity and potential IP concerns. Failure reports (`.ironclad_failures.json`) are distinct from logs and are structured artifacts.\n\n**Metrics Collection Strategy:**\n\n*   Collect key metrics to track system performance and health.\n*   **Tools:** Use a metrics library within the Node.js application (e.g., Prometheus client library) to expose metrics, or simply emit metrics as structured log events that a logging system can parse. In CI/CD, these metrics can be collected by the CI platform or pushed to a time-series database (e.g., Prometheus, InfluxDB, CloudWatch Metrics, Datadog Metrics).\n*   **Key Metrics to Track:**\n    *   `ironclad_build_total_runs_count`: Counter for total `generate run` executions.\n    *   `ironclad_build_success_count`: Counter for successful runs.\n    *   `ironclad_build_failure_count`: Counter for failed runs.\n    *   `ironclad_build_duration_seconds`: Histogram/Summary of total `generate run` duration.\n    *   `ironclad_module_total_generation_attempts_count`: Counter for total IMG/validation attempts across all jobs.\n    *   `ironclad_module_successful_generation_count`: Counter for modules successfully generated (passed validation).\n    *   `ironclad_module_permanent_failure_count`: Counter for modules that failed after all retries.\n    *   `ironclad_job_duration_seconds`: Histogram/Summary of individual Job durations (from spawn to exit).\n    *   `ironclad_validation_step_duration_seconds`: Histogram/Summary per validation step type (tsc, dsl, test runner, etc.), tagged by `validation_step` and `module`.\n    *   `ironclad_validation_step_failure_count`: Counter for failures at each validation step, tagged by `validation_step` and `module`.\n    *   `ironclad_img_api_call_count`: Counter for total calls to the IMG API.\n    *   `ironclad_img_api_error_count`: Counter for errors received from the IMG API (tagged by status code).\n    *   Resource utilization metrics for the Task Runner process and Job processes (CPU, memory, disk I/O) collected by the execution environment.\n\n**Observability:**\n\n*   **Distributed Tracing:** Not directly applicable to this pipeline architecture as it's a sequence of distinct process invocations rather than requests flowing through interconnected services.\n*   **Dashboards:** Create dashboards using metrics and logs in a centralized observability platform.\n    *   Overall build success/failure rates.\n    *   Average build duration and identification of slow trends.\n    *   Breakdown of failures by validation step and module.\n    *   Distribution of Job attempt counts (see how often retries are needed).\n    *   Resource usage trends over time.\n*   **Alerting:** Set up alerts based on critical metrics:\n    *   High `ironclad_build_failure_count` rate.\n    *   Significant increase in `ironclad_module_permanent_failure_count`.\n    *   Increase in IMG API error rate.\n    *   Build duration exceeding a threshold.\n    *   Excessive resource utilization on build agents.\n*   **Incident Response:** When a build fails, the CI/CD platform should provide immediate access to the logs and the `.ironclad_failures.json` artifact. Developers/Engineers use these to diagnose the root cause, identifying whether the failure was due to:\n    *   An issue with the Ironclad tool itself.\n    *   An invalid input specification/contract.\n    *   A limitation or error in the IMG output.\n    *   A problem with the validation rules or engines.\n    *   An environmental issue (resource limits, network).\n\nThis comprehensive approach to logging, metrics, and dashboards provides deep insight into the health and performance of the Ironclad system, enabling proactive identification and resolution of issues during the automated code generation process.\n\n## 12. Testing Strategy\n\nA comprehensive testing strategy is essential to ensure the reliability, correctness, and security of the Ironclad Code Generation System itself and to verify that it consistently produces high-quality, valid code according to the specifications.\n\n**Testing the Ironclad System (IBA, Task Runner, Jobs, Validation Orchestration):**\n\n1.  **Unit Tests:**\n    *   **Scope:** Individual functions or small groups of functions within the IBA, Task Runner, and Job logic.\n    *   **Focus:** Testing business logic independent of external dependencies or file system interactions (where possible). E.g., DAG cycle detection algorithm, prompt construction logic, retry loop state transitions, failure report parsing/collation.\n    *   **Tools:** Standard unit testing frameworks (Jest, Mocha, Vitest). Mocking frameworks for isolating components.\n    *   **Code Coverage:** Aim for high code coverage (e.g., >80%) for critical logic paths.\n2.  **Integration Tests:**\n    *   **Scope:** Testing the interaction between different components of the Ironclad system and with external dependencies (mocked).\n    *   **Focus:**\n        *   IBA interacting with the file system (reading inputs, writing outputs).\n        *   Task Runner discovering modules, preparing workspaces, spawning *mocked* Jobs.\n        *   Task Runner aggregating results from *mocked* Jobs.\n        *   Job orchestrating *mocked* IMG calls and *mocked* Validation Engine calls.\n        *   Testing the logic of collating `final_failure.json` into `.ironclad_failures.json`.\n    *   **Tools:** Jest, Mocha, test runners capable of mocking file system operations and child process spawning.\n3.  **Component Tests:**\n    *   **Scope:** Testing the Validation Engines in isolation or integrated with the code they execute against.\n    *   **Focus:**\n        *   Testing the TypeScript compiler (`tsc`) invocation logic and error parsing.\n        *   Testing the DSL validator implementation against various valid and invalid code snippets based on the `validation_dsl_spec`.\n        *   Testing the test runner invocation logic and result parsing.\n        *   Testing the edge case string check logic.\n    *   **Tools:** Dedicated test suites for each validation engine, potentially involving running the actual external tools (`tsc`, `jest`, custom scripts) in a controlled environment and verifying their output.\n4.  **End-to-End Tests:**\n    *   **Scope:** Running the complete Ironclad pipeline (`ironclad blueprint build` followed by `ironclad generate run`) with realistic sample inputs.\n    *   **Focus:** Verifying that the system correctly processes inputs, interacts with a *mocked* IMG, runs validations, produces correct outputs (generated code, failure reports), and exits with the correct status code. Test both success paths (all modules generate correctly) and failure paths (some modules fail, `.ironclad_failures.json` is generated).\n    *   **Tools:** Scripting languages, shell scripts, or a testing framework capable of executing external processes and asserting on file system state and process exit codes. Use a *mock* IMG service to control the LLM output predictably for testing purposes.\n5.  **Performance/Load Tests:**\n    *   **Scope:** Testing the system's performance under varying load conditions.\n    *   **Focus:**\n        *   Measure execution time with increasing numbers of modules.\n        *   Measure execution time with varying `IRONCLAD_MAX_PARALLEL` settings.\n        *   Monitor CPU, memory, and disk usage during runs.\n        *   Test the system's behavior with large input files or code outputs.\n    *   **Tools:** Benchmarking tools, system monitoring tools.\n6.  **Security Penetration Tests:**\n    *   **Scope:** Probing the Ironclad system for vulnerabilities.\n    *   **Focus:**\n        *   Attempting prompt injection via crafted input files.\n        *   Testing file system access controls and workspace isolation.\n        *   Verifying secure handling of the `IMG_API_KEY`.\n        *   Scanning the Ironclad tool's code and dependencies for known vulnerabilities.\n    *   **Tools:** Standard security scanning tools (SAST, DAST if applicable), manual security review.\n\n**Testing the Generated Code:**\n\nWhile the Ironclad system is responsible for *generating* tests (`*.test.ts`), it's crucial to have a strategy for ensuring the *quality* and *sufficiency* of these generated tests and the generated code itself.\n\n1.  **Generated Unit Test Execution (by Job):** The Job process MUST execute the generated unit tests as part of its validation loop. This verifies that the generated code passes the tests *the LLM itself created*.\n2.  **Global Integration Tests (by Task Runner):** The Task Runner MUST run integration tests defined separately (not generated by the LLM) on the *entire* merged codebase. These tests verify the interaction between modules and the system's overall functionality, acting as a higher-level check that the sum of the parts works correctly.\n3.  **Manual Code Review:** Developers MUST review the generated code, especially in the initial phases, to assess its quality, efficiency, readability, and adherence to implicit standards not captured by automated validation.\n4.  **Manual Test Review:** Developers MUST review the generated tests to ensure they provide adequate coverage, are meaningful, and test the module's behavior effectively. The `edgeCases` check in contracts is a basic way to guide LLM test generation quality.\n5.  **Acceptance Testing (UAT):** For critical modules, manual or automated acceptance tests may be performed on the integrated system using the generated code.\n\n**Tools and Frameworks:**\n\n*   **Testing Frameworks:** Jest, Mocha, Vitest for unit/integration tests.\n*   **Mocking:** Libraries compatible with the chosen test framework. `mock-fs` or similar for file system mocking.\n*   **Validation Tools:** `tsc`, specific DSL validator executables/libraries, test runners (`jest`, `mocha`), linters (`eslint`, `prettier`), security linters (`semgrep`).\n*   **CI/CD Platforms:** To automate test execution on every commit.\n*   **Code Coverage Tools:** `nyc`, built into Jest/Vitest.\n*   **Static Analysis:** SonarQube, Semgrep, ESLint.\n\n**Code Coverage Targets:**\n\n*   **Ironclad Tool Codebase:** Aim for high unit test code coverage (>80%) for core logic.\n*   **Generated Code:** Code coverage targets for the *generated* code should be defined based on project standards. While the LLM generates tests, manually ensuring critical paths are covered and setting coverage gates is good practice. The generated tests executed by the Job should ideally meet a minimum coverage target defined in the DSL spec or configuration.\n\nThis multi-layered testing strategy, combining tests *of* the tool with tests *of* the generated code, provides confidence in both the generation process and its outputs.\n\n## 13. Future Enhancements and Technical Debt Roadmap\n\nThe current architecture provides a solid foundation for automated code generation. As the system matures and requirements evolve, several areas are ripe for enhancement. Additionally, certain design choices might incur technical debt that requires future refactoring.\n\n**Potential Future Enhancements:**\n\n1.  **Support for Multiple Languages:** Extend the system to generate code in languages other than TypeScript (e.g., Python, Java, Go, Rust). This would require:\n    *   Language-specific IDL formats or transformations.\n    *   Language-specific interface stub generation.\n    *   Language-specific prompt templates.\n    *   Integration of language-specific validation tools (compilers, linters, test runners, static analyzers).\n    *   Updating the Job logic to handle different tool invocations.\n2.  **Enhanced DSL Validation Engine:** Develop a more sophisticated and flexible DSL validation engine.\n    *   Support for richer rule definitions (AST-based analysis, control flow analysis).\n    *   A dedicated language or configuration format for the DSL rules, possibly compiled for performance.\n    *   Easier integration of custom or third-party validation checks.\n3.  **LLM Response Caching:** Implement a caching layer for IMG responses based on the prompt hash (`prompt.hash`).\n    *   Requires a persistent cache store (e.g., file system, Redis).\n    *   Careful invalidation strategy (e.g., cache expires, cache invalidated if IMG_API_URL/version changes, manual invalidation).\n    *   Mechanism to bypass the cache for specific runs or modules.\n4.  **Interactive Failure Debugging:** Develop tooling to assist developers in debugging generation failures.\n    *   A CLI command to recreate a Job's workspace for local inspection and re-running validation steps manually.\n    *   Providing more context in the failure reports (e.g., relevant snippet of the prompt, specific lines of generated code causing validation errors).\n5.  **Generation of Other Artifacts:** Extend the system to generate documentation (e.g., JSDoc, OpenAPI specs from contracts/code), API gateway configurations, deployment manifests (Kubernetes YAML, Dockerfiles), or configuration files based on the architectural specifications.\n6.  **Improved Prompt Templating:** Move to a more powerful and maintainable templating engine with features like partials, helpers, and better error handling.\n7.  **Dependency Management Generation:** Explore generating dependency declarations (e.g., `package.json` entries) based on the module dependency graph, although this is complex due to versioning conflicts.\n8.  **Optimized Workspace Preparation:** For very large repositories, optimize workspace creation using advanced file system techniques (copy-on-write snapshots if available) or more sophisticated symlinking strategies.\n\n**Technical Debt Roadmap:**\n\n1.  **Initial DSL Validator Implementation:** The initial DSL validator might be a simple script performing regex checks or basic string matching.\n    *   **Debt:** Limited rule complexity, prone to false positives/negatives, hard to maintain.\n    *   **Resolution:** Refactor into a robust AST-based validator (Phase 2/3 Enhancement).\n2.  **Prompt Template Management:** Using simple text files with a basic templating syntax.\n    *   **Debt:** Can become unwieldy for complex prompts, limited logic in templates.\n    *   **Resolution:** Migrate to a more powerful templating engine (Phase 1/2 Enhancement).\n3.  **Workspace Cleanup Robustness:** Ensuring temporary workspaces are *always* cleaned up, even after unexpected process termination.\n    *   **Debt:** Could lead to disk space exhaustion over time.\n    *   **Resolution:** Implement cleanup using `try...finally` blocks, process exit handlers, or an external cleanup utility that runs periodically.\n4.  **Error Reporting Consistency:** Ensuring all validation engines and internal components report errors in a uniform, machine-readable format for easy aggregation.\n    *   **Debt:** Inconsistent formats make parsing `failures.json` difficult.\n    *   **Resolution:** Define a strict error reporting schema and ensure all components adhere to it.\n\n**High-Level Phased Roadmap (Conceptual):**\n\n*   **Phase 1 (Core Functionality - Current):** Implement the core IBA and Task Runner protocol as specified, focusing on TypeScript generation, basic validation (tsc, test execution, simple DSL/edge case), and robust failure reporting.\n*   **Phase 2 (Validation & Usability):** Enhance validation capabilities (more powerful DSL, better linters, security checks). Improve CLI output and failure reporting readability. Implement workspace recreation for debugging.\n*   **Phase 3 (Extensibility & Performance):** Explore support for a second language. Implement LLM response caching. Optimize file operations. Refactor core validation engine.\n*   **Phase 4 (Broader Generation):** Add capabilities to generate documentation, deployment manifests, or other project artifacts.\n\nThis roadmap allows for incremental development, delivering core value first while planning for future growth, robustness, and broader applicability.\n\n## 14. Non-Functional Requirements (NFRs) Summary\n\nThis section summarizes the key non-functional requirements that govern the quality attributes of the Ironclad Code Generation System.\n\n*   **Reliability:**\n    *   **Deterministic Output:** Given the same inputs (including the specific IMG version/state), the system SHALL produce byte-for-byte identical outputs (generated code, failure reports, exit code). This is a cornerstone requirement.\n    *   **Consistent Failure Reporting:** When failures occur, the system SHALL produce a structured, machine-readable report (`.ironclad_failures.json`) that accurately reflects the validation errors encountered.\n    *   **Fault Isolation:** Failure during the generation/validation of one module SHALL NOT prevent the successful generation/validation of other independent modules or crash the entire Task Runner process.\n    *   **Retry Mechanism:** The system SHALL attempt LLM invocation and validation up to 3 times per module Job to mitigate transient failures.\n    *   **MTBF (Mean Time Between Failures):** While not a continuous service, the tooling itself should be stable. Aim for a high MTBF for the core Task Runner process during a run, minimizing crashes of the tool itself.\n    *   **MTTR (Mean Time To Recover):** Failures in individual module Jobs are reported immediately. Recovery involves developer action based on the failure report. The tool's design supports rapid diagnosis via detailed logging and the `.ironclad_failures.json` artifact.\n\n*   **Availability:**\n    *   The system's availability is tied to the availability of the build environment (CI/CD runner) and the external IMG API. It is not a 24/7 service.\n    *   The system SHALL gracefully handle unavailable or slow IMG APIs (via retries and timeouts), although persistent unavailability will cause the build to fail.\n\n*   **Performance:**\n    *   **Throughput:** The system SHALL be able to process N modules within T time, where T is reasonably linear with N for N > `IRONCLAD_MAX_PARALLEL`, assuming sufficient resources and a responsive IMG API. Target: Generate and validate 100 modules (average complexity) within 15 minutes on a standard build agent with `IRONCLAD_MAX_PARALLEL` appropriately configured.\n    *   **Latency (per Job):** The average time for a single module Job (including retries if needed) SHALL be minimized. Target: Average Job completion time < 2 minutes.\n    *   **Resource Utilization:** The system SHALL operate within reasonable CPU, memory, and disk limits for a build process on the target CI environment. Memory usage per Job SHALL be constrained.\n\n*   **Scalability:**\n    *   The system SHALL support scaling generation throughput by increasing the `IRONCLAD_MAX_PARALLEL` setting, up to the limits of the execution environment and external IMG API.\n    *   The architecture SHALL remain viable for projects with hundreds or thousands of modules, although execution time will increase proportionally to the number of modules and the `IRONCLAD_MAX_PARALLEL` setting.\n\n*   **Maintainability:**\n    *   The codebase for the Ironclad tooling SHALL adhere to standard coding practices (e.g., ESLint, Prettier) and include comprehensive documentation (code comments, architectural diagrams).\n    *   Components SHALL have clear responsibilities and well-defined interfaces to minimize coupling.\n    *   The system's configuration and input files SHALL be well-structured and documented.\n\n*   **Extensibility:**\n    *   It SHALL be possible to integrate new validation rules into the DSL validation process without modifying core Task Runner logic.\n    *   It SHALL be possible to modify or add prompt templates to guide the LLM for different module types or requirements.\n    *   The architecture SHOULD allow for the addition of support for generating code in new programming languages in future phases with isolated component changes.\n\n*   **Auditability:**\n    *   The system SHALL produce logs detailing the execution flow, including Job spawning, attempts, and validation results.\n    *   The `.ironclad_failures.json` file provides a record of all generation failures for a specific run.\n    *   The BlueprintLock headers provide cryptographic verification of the integrity of core architectural input files.\n    *   The generated code itself, when checked into version control, provides an audit trail of the output.\n\n*   **Security:**\n    *   The system SHALL prevent prompt injection attempts from compromising the integrity of the generation process or output code, primarily through rigorous input validation and output validation.\n    *   The system SHALL handle sensitive credentials (IMG API key) securely, relying on environment variables or dedicated secret management.\n    *   Generated code SHALL be subjected to static analysis and security linting as part of the validation process.\n    *   Jobs SHALL be executed in isolated environments to limit the impact of malicious or faulty generated code during the validation phase.\n\n*   **Compliance:**\n    *   The Ironclad tool itself doesn't typically require compliance like GDPR or HIPAA unless the *inputs* or *generated code* contain sensitive data, which is outside the scope of the tool's core function but must be considered in its *usage*. The tool's secure handling of input data and secrets contributes to overall system compliance where applicable.\n    *   The generated code should pass checks defined in the `validation_dsl_spec.md`, which can include compliance-related rules (e.g., logging formats required for audit trails, specific data handling patterns).\n\nThese NFRs define the necessary qualities the Ironclad system must possess to be a reliable, performant, and trustworthy part of the software development lifecycle.\n\n## 15. Glossary and Definitions\n\nThis glossary defines key terms, acronyms, and architectural concepts used throughout this document to ensure a shared understanding.\n\n*   **ARCHITECTURE_SPEC:** The primary Markdown file that defines the overall structure and modules of the system to be generated.\n*   **BlueprintLock:** A header (e.g., `BlueprintLock: sha256:<hash>`) added by the IBA to files it generates or copies into the repository, used for verifying file integrity. The hash is a SHA-256 checksum of the file's content, including the final header line itself.\n*   **Contracts (Module Contracts):** JSON files (`contracts/*.json`) formally defining the interface, dependencies, and generation instructions for individual modules.\n*   **DAG (Directed Acyclic Graph):** A graph data structure where nodes are connected by directed edges (dependencies) and contain no cycles. The module dependency graph must be a DAG.\n*   **Deterministic:** A process or system is deterministic if, given the same input, it always produces the same output. A core goal of the Ironclad system.\n*   **DSL (Domain Specific Language):** A small language or format used to define specific rules or configurations. `validation_dsl_spec.md` uses a DSL to define code validation rules.\n*   **IBA (Ironclad Blueprint Architect):** The initial process that reads the `ARCHITECTURE_SPEC` and related files, validates the input, and scaffolds the initial repository structure including interface stubs and BlueprintLocks.\n*   **IDL (Interface Definition Language):** Files (`idl/*.ts`) defining shared data types and interfaces used across modules and contracts.\n*   **IMG (Ironclad Module Generator):** The external Large Language Model (LLM) invocation responsible for generating the implementation and test code for a single module based on a prompt. Treated as an external service via an API.\n*   **Independently:** Describes a Job operating with no read or write dependency on any files generated by another concurrent Job, except for the initial shared input files in the workspace.\n*   **Interface Stub:** A TypeScript interface file (`src/modules/I<ModuleName>.ts`) generated by the IBA, representing the public contract of a module for type checking.\n*   **Job:** A single, isolated operating-system process spawned by the Task Runner to handle the full lifecycle (IMG invocation, validation, retries) for exactly one Module-Generation Task.\n*   **LLM (Large Language Model):** The type of AI model used by the IMG to generate code.\n*   **Module-Generation Task:** A single, isolated unit of work performed by a Job, involving invoking the IMG and validating the output for one specific module.\n*   **NFRs (Non-Functional Requirements):** Quality attributes of the system such as performance, scalability, reliability, security, and maintainability, as opposed to functional behavior.\n*   **Parallel:** Multiple Jobs executing concurrently in time, with their start and end times overlapping, limited by `IRONCLAD_MAX_PARALLEL`.\n*   **Prompt Amendment:** The process within a Job's retry loop where details of previous validation failures are added to the prompt before re-invoking the IMG.\n*   **Prompt Template:** A file (`prompt_templates/*.tmpl`) containing a template used by the Task Runner to construct the `prompt.txt` for the IMG.\n*   **Repository:** The file system directory containing all input specifications, generated code, and output reports for a specific project using the Ironclad system. Managed via Git.\n*   **Spawn:** To create a completely separate operating-system process, container, or cloud function invocation for executing a Job.\n*   **System Context:** A JSON file (`system_context.json`) providing global information and context relevant to the generation of all modules.\n*   **Task Runner:** The main orchestration process that discovers modules, prepares workspaces, manages concurrency, spawns Jobs, awaits their completion, aggregates results, and performs global validation.\n*   **Task Workspace:** A temporary, isolated directory (`.tmp/ironclad_tasks/<ModuleName>/`) created by the Task Runner for a single Job to operate within. Contains only the files necessary for that specific module's task.\n*   **Validation:** The deterministic, automated sequence of checks performed by a Job on generated code, including static type-checking, DSL-rule validation, linter checks, edge case string checks, and execution of the generated test file.\n\nThis glossary serves as a quick reference for understanding the terminology used within this architectural document and the Ironclad system specification.\n\nA.1 Component & Sequence Diagrams (non-normative)\nmermaid\nCopy\nEdit\nflowchart TD\n    subgraph Control-Plane\n        IBA[Ironclad Blueprint Architect]\n        TR[Task Runner]\n    end\n    subgraph N(x) Module-Jobs\n        Job1[Job::<Module>]\n        JobN[…]\n    end\n\n    IBA -->|Blueprint skeleton| TR\n    TR -->|spawn| Job1\n    TR -->|spawn| JobN\n    Job1 -->|impl+tests| TR\n    JobN --> TR\nmermaid\nCopy\nEdit\nsequenceDiagram\n    autonumber\n    participant TR as Task-Runner\n    participant Job as Module-Job\n    participant IMG as LLM (IMG)\n\n    TR->>Job: spawn()\n    Job->>IMG: prompt.txt (attempt 1)\n    IMG-->>Job: JSON {impl, tests}\n    Job->>Job: validate ➜ ❌\n    loop up to 3 attempts\n        Job->>IMG: amended prompt (includes LAST_ERROR)\n        IMG-->>Job: new JSON\n        Job->>Job: validate\n    end\n    Job-->>TR: success ✓ or final_failure.json\nA.2 Canonical JSON Schemas & Examples\n<details><summary>contracts/<ModuleName>.json</summary>\njsonc\nCopy\nEdit\n{\n  \"$schema\": \"https://json-schema.org/draft/2020-12/schema\",\n  \"title\": \"ModuleContract\",\n  \"type\": \"object\",\n  \"required\": [\"name\",\"purpose\",\"publicAPI\",\"dependencies\",\"constructorParams\"],\n  \"properties\": {\n    \"name\": { \"type\": \"string\", \"pattern\": \"^[A-Z][A-Za-z0-9]+$\" },\n    \"purpose\": { \"type\": \"string\", \"minLength\": 10 },\n    \"functionSignatures\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"type\": \"object\",\n        \"required\": [\"name\",\"parameters\",\"returnType\"],\n        \"properties\": {\n          \"name\": { \"type\": \"string\" },\n          \"parameters\": { \"type\": \"array\", \"items\": {\"$ref\":\"#/definitions/param\"} },\n          \"returnType\": { \"type\": \"string\" },\n          \"description\": { \"type\": \"string\" }\n        }\n      }\n    },\n    \"dataStructures\":   { \"type\": \"array\", \"items\": {\"$ref\":\"#/definitions/dataStruct\"} },\n    \"publicAPI\":        { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"dependencies\":     { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"constructorParams\":{ \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"instructions\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"overview\":   { \"type\": \"string\" },\n        \"steps\":      { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n        \"edgeCases\":  { \"type\": \"array\", \"items\": { \"type\": \"string\" } }\n      }\n    }\n  },\n  \"definitions\": {\n    \"param\":      { \"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"},\"type\":{\"type\":\"string\"}}},\n    \"dataStruct\": { \"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"},\"properties\":{\"type\":\"array\",\"items\":{\"$ref\":\"#/definitions/param\"}}}}\n  }\n}\nMinimal example:\n\njson\nCopy\nEdit\n{\n  \"name\": \"UserService\",\n  \"purpose\": \"Business-logic façade for user CRUD and profile enrichment.\",\n  \"publicAPI\": [\"createUser\",\"getById\"],\n  \"dependencies\": [\"EmailAdapter\"],\n  \"constructorParams\": [\"EmailAdapter\"],\n  \"functionSignatures\": [\n    { \"name\":\"createUser\", \"parameters\":[{\"name\":\"dto\",\"type\":\"CreateUserDTO\"}], \"returnType\":\"User\" },\n    { \"name\":\"getById\",    \"parameters\":[{\"name\":\"id\",\"type\":\"string\"}],      \"returnType\":\"User\" }\n  ],\n  \"instructions\": {\n    \"overview\": \"Send welcome-mail after persisting user.\",\n    \"steps\": [\n      \"Validate DTO\",\n      \"Hash password with bcrypt-12\",\n      \"Persist record\",\n      \"Invoke EmailAdapter.sendWelcome\"\n    ],\n    \"edgeCases\": [\"email already exists\",\"db timeout > 1s\"]\n  }\n}\n</details> <details><summary>final_failure.json</summary>\njson\nCopy\nEdit\n{\n  \"module\": \"UserService\",\n  \"attempts\": 3,\n  \"lastPromptHash\": \"sha256:ab12…\",\n  \"errorSummary\": \"Edge-case 'db timeout > 1s' not covered in tests.\"\n}\n</details>\nA.3 Prompt-Template Reference (prompt_templates/module_prompt.tmpl)\ntext\nCopy\nEdit\n### DO NOT EDIT ABOVE THIS LINE – auto-generated ###\nModule: {{ contract.name }}\n\n<CONTRACT_JSON>\n{{ contract | toJsonPretty }}\n</CONTRACT_JSON>\n\n<IDL_SNIPPETS>\n{{ idlSnippets }}\n</IDL_SNIPPETS>\n\n<SYSTEM_CONTEXT>\n{{ systemContext | toJsonPretty }}\n</SYSTEM_CONTEXT>\n\n{{#if previousFailure}}\n===LAST_ERROR===\n{{ previousFailure | toJsonPretty }}\n{{/if}}\n\n### REQUIRED_OUTPUT\nRespond with EXACT JSON:\n{\n  \"implementationCode\": \"string\",\n  \"testCode\": \"string\"\n}\nA.4 Environment-Variable Contract\nVar\tDefault\tSecret\tDescription\nIMG_API_KEY\t—\t✅\tAPI key for the LLM provider.\nIRONCLAD_MAX_PARALLEL\t4\t❌\tMax concurrent Jobs.\nTS_NODE_TRANSPILE_ONLY\t1\t❌\tSpeeds up jest runs during validation.\n\nA.5 Concurrency Sizing Formula\nbash\nCopy\nEdit\nmaxJobs = min(\n  cpuCores / 1,                 # ~1 core per Job\n  availMemGB / 2,               # ~2 GB per Job incl. LLM call\n  providerQPS / callsPerJob,    # respect API quotas\n  IRONCLAD_MAX_PARALLEL env\n)\nA.6 Exit-Code Taxonomy\nCode\tMeaning\n0\tAll modules built & global checks passed.\n65\tAttempt to overwrite existing src file (EX_DATAERR).\n100\tAt least one final_failure.json present.\n101\tGlobal type-check failed.\n102\tDSL or lint validation failed.\n130\tInterrupted via SIGINT/SIGTERM.\n\nA.7 Sample Interface Stub & IDL\nIDL (idl/user_service.idl)\n\npgsql\nCopy\nEdit\nservice UserService {\n  rpc Create(CreateUserDTO) returns User;\n  rpc GetById(string id)    returns User;\n}\nGenerated stub (src/modules/IUserService.ts)\n\nts\nCopy\nEdit\nexport interface IUserService {\n  createUser(dto: CreateUserDTO): Promise<User>;\n  getById(id: string): Promise<User>;\n}\nA.8 BlueprintLock Verification Snippet\nbash\nCopy\nEdit\n#!/usr/bin/env bash\nset -euo pipefail\nfile=\"$1\"\nexpected=$(grep -Eo 'BlueprintLock: sha256:[a-f0-9]+' \"$file\" | cut -d: -f3)\nactual=$(sha256sum \"$file\" | awk '{print $1}')\nif [[ \"$expected\" != \"$actual\" ]]; then\n  echo \"Lock mismatch for $file\" >&2\n  exit 1\nfi\n\n\n---\n\n## 🔧 Appendix A — Remaining Specification Gaps\n\n### A.1 Component & Sequence Diagrams  *(non-normative)*\n\n```mermaid\nflowchart TD\n    subgraph Control-Plane\n        IBA[Ironclad Blueprint Architect]\n        TR[Task Runner]\n    end\n    subgraph N(x) Module-Jobs\n        Job1[Job::<Module>]\n        JobN[…]\n    end\n\n    IBA -->|Blueprint skeleton| TR\n    TR -->|spawn| Job1\n    TR -->|spawn| JobN\n    Job1 -->|impl+tests| TR\n    JobN --> TR\n```\n\n```mermaid\nsequenceDiagram\n    autonumber\n    participant TR as Task-Runner\n    participant Job as Module-Job\n    participant IMG as LLM (IMG)\n\n    TR->>Job: spawn()\n    Job->>IMG: prompt.txt (attempt 1)\n    IMG-->>Job: JSON {impl, tests}\n    Job->>Job: validate ➜ ❌\n    loop up to 3 attempts\n        Job->>IMG: amended prompt (includes LAST_ERROR)\n        IMG-->>Job: new JSON\n        Job->>Job: validate\n    end\n    Job-->>TR: success ✓ or final_failure.json\n```\n\n---\n\n### A.2 Canonical JSON Schemas & Examples\n\n<details><summary>contracts/<ModuleName>.json</summary>\n\n```jsonc\n{\n  \"$schema\": \"https://json-schema.org/draft/2020-12/schema\",\n  \"title\": \"ModuleContract\",\n  \"type\": \"object\",\n  \"required\": [\"name\",\"purpose\",\"publicAPI\",\"dependencies\",\"constructorParams\"],\n  \"properties\": {\n    \"name\": { \"type\": \"string\", \"pattern\": \"^[A-Z][A-Za-z0-9]+$\" },\n    \"purpose\": { \"type\": \"string\", \"minLength\": 10 },\n    \"functionSignatures\": {\n      \"type\": \"array\",\n      \"items\": {\n        \"type\": \"object\",\n        \"required\": [\"name\",\"parameters\",\"returnType\"],\n        \"properties\": {\n          \"name\": { \"type\": \"string\" },\n          \"parameters\": { \"type\": \"array\", \"items\": {\"$ref\":\"#/definitions/param\"} },\n          \"returnType\": { \"type\": \"string\" },\n          \"description\": { \"type\": \"string\" }\n        }\n      }\n    },\n    \"dataStructures\":   { \"type\": \"array\", \"items\": {\"$ref\":\"#/definitions/dataStruct\"} },\n    \"publicAPI\":        { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"dependencies\":     { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"constructorParams\":{ \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n    \"instructions\": {\n      \"type\": \"object\",\n      \"properties\": {\n        \"overview\":   { \"type\": \"string\" },\n        \"steps\":      { \"type\": \"array\", \"items\": { \"type\": \"string\" } },\n        \"edgeCases\":  { \"type\": \"array\", \"items\": { \"type\": \"string\" } }\n      }\n    }\n  },\n  \"definitions\": {\n    \"param\":      { \"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"},\"type\":{\"type\":\"string\"}}},\n    \"dataStruct\": { \"type\":\"object\",\"properties\":{\"name\":{\"type\":\"string\"},\"properties\":{\"type\":\"array\",\"items\":{\"$ref\":\"#/definitions/param\"}}}}\n  }\n}\n```\n\nMinimal example:\n\n```json\n{\n  \"name\": \"UserService\",\n  \"purpose\": \"Business-logic façade for user CRUD and profile enrichment.\",\n  \"publicAPI\": [\"createUser\",\"getById\"],\n  \"dependencies\": [\"EmailAdapter\"],\n  \"constructorParams\": [\"EmailAdapter\"],\n  \"functionSignatures\": [\n    { \"name\":\"createUser\", \"parameters\":[{\"name\":\"dto\",\"type\":\"CreateUserDTO\"}], \"returnType\":\"User\" },\n    { \"name\":\"getById\",    \"parameters\":[{\"name\":\"id\",\"type\":\"string\"}],      \"returnType\":\"User\" }\n  ],\n  \"instructions\": {\n    \"overview\": \"Send welcome-mail after persisting user.\",\n    \"steps\": [\n      \"Validate DTO\",\n      \"Hash password with bcrypt-12\",\n      \"Persist record\",\n      \"Invoke EmailAdapter.sendWelcome\"\n    ],\n    \"edgeCases\": [\"email already exists\",\"db timeout > 1s\"]\n  }\n}\n```\n\n</details>\n\n<details><summary>final_failure.json</summary>\n\n```json\n{\n  \"module\": \"UserService\",\n  \"attempts\": 3,\n  \"lastPromptHash\": \"sha256:ab12…\",\n  \"errorSummary\": \"Edge-case 'db timeout > 1s' not covered in tests.\"\n}\n```\n\n</details>\n\n---\n\n### A.3 Prompt-Template Reference (`prompt_templates/module_prompt.tmpl`)\n\n```text\n### DO NOT EDIT ABOVE THIS LINE – auto-generated ###\nModule: {{ contract.name }}\n\n<CONTRACT_JSON>\n{{ contract | toJsonPretty }}\n</CONTRACT_JSON>\n\n<IDL_SNIPPETS>\n{{ idlSnippets }}\n</IDL_SNIPPETS>\n\n<SYSTEM_CONTEXT>\n{{ systemContext | toJsonPretty }}\n</SYSTEM_CONTEXT>\n\n{{#if previousFailure}}\n===LAST_ERROR===\n{{ previousFailure | toJsonPretty }}\n{{/if}}\n\n### REQUIRED_OUTPUT\nRespond with EXACT JSON:\n{\n  \"implementationCode\": \"string\",\n  \"testCode\": \"string\"\n}\n```\n\n---\n\n### A.4 Environment-Variable Contract\n\n| Var                      | Default | Secret | Description                            |\n| ------------------------ | ------- | ------ | -------------------------------------- |\n| `IMG_API_KEY`            | —       | ✅      | API key for the LLM provider.          |\n| `IRONCLAD_MAX_PARALLEL`  | `4`     | ❌      | Max concurrent Jobs.                   |\n| `TS_NODE_TRANSPILE_ONLY` | `1`     | ❌      | Speeds up jest runs during validation. |\n\n---\n\n### A.5 Concurrency Sizing Formula\n\n```\nmaxJobs = min(\n  cpuCores / 1,                 # ~1 core per Job\n  availMemGB / 2,               # ~2 GB per Job incl. LLM call\n  providerQPS / callsPerJob,    # respect API quotas\n  IRONCLAD_MAX_PARALLEL env\n)\n```\n\n---\n\n### A.6 Exit-Code Taxonomy\n\n| Code  | Meaning                                               |\n| ----- | ----------------------------------------------------- |\n| `0`   | All modules built & global checks passed.             |\n| `65`  | Attempt to overwrite existing src file (EX\\_DATAERR). |\n| `100` | At least one `final_failure.json` present.            |\n| `101` | Global type-check failed.                             |\n| `102` | DSL or lint validation failed.                        |\n| `130` | Interrupted via SIGINT/SIGTERM.                       |\n\n---\n\n### A.7 Sample Interface Stub & IDL\n\n*IDL (`idl/user_service.idl`)*\n\n```\nservice UserService {\n  rpc Create(CreateUserDTO) returns User;\n  rpc GetById(string id)    returns User;\n}\n```\n\n*Generated stub (`src/modules/IUserService.ts`)*\n\n```ts\nexport interface IUserService {\n  createUser(dto: CreateUserDTO): Promise<User>;\n  getById(id: string): Promise<User>;\n}\n```\n\n---\n\n### A.8 BlueprintLock Verification Snippet\n\n```bash\n#!/usr/bin/env bash\nset -euo pipefail\nfile=\"$1\"\nexpected=$(grep -Eo 'BlueprintLock: sha256:[a-f0-9]+' \"$file\" | cut -d: -f3)\nactual=$(sha256sum \"$file\" | awk '{print $1}')\nif [[ \"$expected\" != \"$actual\" ]]; then\n  echo \"Lock mismatch for $file\" >&2\n  exit 1\nfi\n```",
  "reasoning_tree": {
    "Phase 1: Foundation and Ironclad Blueprint Architect (IBA) Implementation": {
      "Task 1.1: Define and implement the 'CONSTITUTION_GENERATION_PROMPT' in a new 'prompts' directory to resolve the current error.": [],
      "Task 1.2: Implement the Python logic to load the user goal, use the 'CONSTITUTION_GENERATION_PROMPT' with an LLM, and generate the 'project_constitution.json' file.": [],
      "Task 1.3: Establish the core project directory structure, including 'src', 'tests', and a 'workspace' for generated artifacts.": [],
      "Task 1.4: Define the Pydantic schema for the 'Ironclad Blueprint' in 'src/schemas/blueprint.py', detailing the required structure for project components, data models, and implementation phases.": [],
      "Task 1.5: Create the 'BLUEPRINT_GENERATION_PROMPT' in the 'prompts' directory, which will guide the AI to generate a detailed technical plan based on the constitution.": [],
      "Task 1.6: Implement the 'IroncladBlueprintArchitect' (IBA) agent in 'src/agents/iba.py' to orchestrate the loading of the constitution, calling the LLM with the blueprint prompt, and saving the validated output.": [],
      "Task 1.7: Develop a main execution script ('main.py') to run the complete Phase 1 sequence: constitution generation followed by blueprint generation.": [],
      "Task 1.8: Write unit tests in the 'tests' directory for the IBA agent, focusing on input handling, prompt integration, and output validation against the blueprint schema.": []
    },
    "Phase 2: Core Generation Logic: The Isolated Job and Validation Engines": {
      "Implement the Job worker process entry point, including reading the prompt and verifying its hash from the workspace.": [],
      "Develop the IMG API client for making secure, authenticated calls to the external LLM and parsing the JSON response.": [],
      "Create the TypeScript Compilation validation engine, which invokes `tsc --noEmit` on generated code and parses any errors.": [],
      "Build the Test Execution validation engine, which runs the generated tests using a framework like Jest and captures the results.": [],
      "Implement the initial DSL Rule validation engine to check generated code against rules defined in `validation_dsl_spec.md`.": [],
      "Implement the Edge Case String Check validator to verify that generated test code literally mentions required scenarios from the contract.": [],
      "Construct the main control loop within the Job, managing the 3-attempt retry logic.": [],
      "Implement the prompt amendment feature, which appends structured error details from the last failed validation to the prompt for the next attempt.": [],
      "Develop the failure reporting mechanism for the Job, writing detailed errors to `failures.json` and a summary to `final_failure.json` upon permanent failure.": [],
      "Implement the success path logic, where validated code and test files are written to the workspace and the Job exits successfully.": [],
      "Write unit and integration tests for the Job process and each of its validation engines, using mock code and API responses.": []
    },
    "Phase 3: Orchestration and Concurrency: The Task Runner": {
      "Task 3.1: Implement the main CLI entry point for the `ironclad generate run` command.": [],
      "Task 3.2: Develop the module discovery mechanism to enumerate all `contracts/*.json` files.": [],
      "Task 3.3: Design and implement the concurrency manager to spawn and limit parallel Job processes according to `IRONCLAD_MAX_PARALLEL`.": [],
      "Task 3.4: Implement workspace creation logic to generate an isolated directory for each module under `.tmp/ironclad_tasks/`.": [],
      "Task 3.5: Develop the workspace preparation logic to copy or symlink required files (contract, dependencies, IDLs, interface stubs) into each workspace.": [],
      "Task 3.6: Implement the prompt constructor to populate a prompt template and generate `prompt.txt` and `prompt.hash` in the workspace.": [],
      "Task 3.7: Implement the Job spawning mechanism using Node.js `child_process` to execute a worker script in an isolated workspace.": [],
      "Task 3.8: Develop the logic to monitor Job processes, await their completion, and capture their exit status.": [],
      "Task 3.9: Implement the result aggregation logic to process Job outcomes, distinguishing between success and failure.": [],
      "Task 3.10: Implement the success path to merge validated code and test files from a successful Job's workspace into the main `src` directory.": [],
      "Task 3.11: Implement the failure path to collate all `final_failure.json` reports from failed Jobs into a single top-level `.ironclad_failures.json` file.": [],
      "Task 3.12: Implement the global validation step to run a full-project `tsc --noEmit` check after all successful modules are merged.": [],
      "Task 3.13: Implement the final exit code logic based on the presence of failures or global validation errors.": [],
      "Task 3.14: Define the precise CLI contract (arguments, expected outputs) for the standalone 'Job' worker script that the Task Runner will spawn.": []
    },
    "Phase 4: System Integration, Security Hardening, and Deployment Packaging": {}
  },
  "last_processed_phase": "Phase 3: Orchestration and Concurrency: The Task Runner",
  "last_processed_task": null
}